"Kevo"
{"Author": "Bradley Wuthrich", "Date": "September 28, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "The privacy policy us almost as bad as Schlage's. Like most corporations they share with their partners which makes sense; however, how that information is protected and used beyond them is unspecified and not protected by the privacy policy. I would prefer apps and devices independent of GPS tracking, cloud based services, and data collection.  They should work independently of their creators. I like IP enabled devices that can be managed outside of their creators. I would be more comfortable with Quickset if they offered an app and device that did not collect or connect online. Just solely Bluetooth &amp; NFC"}
{"Author": "Stephen Thompson", "Date": "September 30, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This app has been working great since February 2017 but since the last couple of updates it doesn't work properly in any consistent way. I'm using a Samsung Galaxy S7 on Android 6.1 and its reliability has dropped to such a low point that I now need to carry physical keys with me because it only works less than 40% of the time. Sometimes I log off and back on the app works and sometimes it doesn't. I'm having the same issue on a second phone an iPhone 6. These are both Kevo 1st generation deadbolts.  Same issue with both locks."}
{"Author": "jeff strong", "Date": "September 26, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I have a Galaxy S8 plus. The app used to work fine on my phone until the most recent update in September 2017 and now it hasn't worked since. I feel like I've been scammed on a $230 lock that I now have to carry a key with me all the time. TiVo needs to step up their game quickly! This is baloney"}
{"Author": "mauricio santiago", "Date": "September 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Note 8, no app support. Based on other user reviews, apparently most android phones aren't supported. Prior to my note 8 my moto z would constantly stop working or reading the kevo, same with a pixel. It's apparent android isnt supported by kevo, but if so it should not be marketed as such... save me the headache and I would not have purchased!! Anyone reading this, don't buy (assuming you dont have an iPhone, because why would you be in the play store?)"}
{"Author": "Evan Labbe", "Date": "October 3, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The touch lock works when it feels like it. I carry a physical key around at all times since its on a business.   Setup is simple, easy to manage, battery life is ok.   But phone support also seems to be an issue. My brothers galaxy s8 seems to work, but my note 8 doesn't. All of our other phones are supported, but how well they work is hit or miss. My IPhone 6, fails almost every time. The iPhone 7 works well, and my old note 4 works every single time.   It's a terribly frustrating system from a reliability standpoint."}
{"Author": "Tyler Beckett", "Date": "September 19, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "And back to not supporting my phone. I just picked up the Essential PH-1 and this app does not work despite having Bluetooth LE. Can only manually unlock in the app, cannot unlock using the phone as a key."}
{"Author": "Sean Conroy", "Date": "September 27, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Great on my s6 edge plus but now on my Note 8 it's not supported. So now it's useless! Not sure why it takes KEVO so long to send updates for Android phones! Don't buy if you have a newer Android device!!!!"}
{"Author": "dragon788", "Date": "October 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Friend wanted me to stop by and pick up something from his place, \"get the Kevo app and it'll let you unlock the door\" he said. I signed up for an account, logged in and got the guest eKEY he sent me, went to his place and couldn't unlock the door with either of my phones. One is on the supported list and the other is new enough to have all the Bluetooth features required, yet neither works. Guess I won't be buying any for my own home."}
{"Author": "Nestor Rivera", "Date": "October 18, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I really like the concept and the general functionality. However, it takes a few tries to get it to lock/unlock after extended absences."}
{"Author": "Sean Bello", "Date": "October 6, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Response time has been awful with Oreo. It takes multiple tries to lock or unlock, taking away it's convenience. Having a piece of tech that doesn't work correctly is embarrassing, so getting a better product."}
{"Author": "Brooke B.", "Date": "September 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I am getting a \"unknown location\" every time I log on to app. Where it lets you unlock the front door from app. My boyfriend has the app. And has a galaxy 6 and his can unlock the door from app. And it shows the location. I have the galaxy 8 and I can't. PLEASE FIX this for us galaxy 8's!!!! Other than that love the app.  Very handy when you don't feel like digging for keys in purse :)"}
{"Author": "Sammn Maillet", "Date": "September 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Had trouble on my S8+, wont even work with my Note 8. please fix, really sucks not being able to get in my front door."}
{"Author": "Robin Rehberg", "Date": "September 13, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "They are too slow making updates and supporting devices. Lost use of it after Oreo update.  Simple Bluetooth app, shouldn't be that complicated."}
{"Author": "Rob Brawders", "Date": "September 26, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "This lock has come a long way. The latest updates really have improved the range and consistency with which is detects devices, and has eliminated most of the lag between when you touch your Kevo and when it actually unlocks. Not quite ready for prime-time yet, still a little flaky and will leave you standing at your door touching the lock wondering why it's not locking/unlocking every couple of times you to go use it. Fobs.. those still seem to be something of a dumpster fire. But hey, at least with the app on your phone things are improving!"}
{"Author": "Juan hernandez", "Date": "October 14, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "I have the gateway and its annoying that it asks to turn on the Bluetooth every dam time. Also fails to communicate."}
{"Author": "Kelly Lane", "Date": "September 19, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The app is junk, so is the hardware. Do not waste your time or money"}
{"Author": "Kenneth Foggie", "Date": "October 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The Samsung Galaxy Note 8 has been out for almost a month now and I'm still getting unsupported device errors. $229 for this horrible support"}
{"Author": "", "Date": "September 12, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Improved, starting to get there. Not fully supporting Android Oreo yet, disappointing."}
{"Author": "Chris G", "Date": "October 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Android supported my ass. Dont sell a product claiming its android capable when infact it only supports like two types of phones. Not sure why the phone matters when its the software that should! I have a LG G4 and right upon installation, I basically cant do ANYTHING with the app that would give me access to the door by any means. Dont waste your money on this hyped up doorlock and go back to the manual ways. Kwikset/KEVO you should be embarassed with this product and the support it doesnt even provide. Read the reviews people! It doesnt work unless you own a google phone or only a Galaxy series phone..someone must be making good money off that."}
{"Author": "John Puhoff", "Date": "September 15, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Love the program but after android wear 2.0 update the app crashes on smart watch can u guys fix it? Thanks"}
{"Author": "Jacky Feng", "Date": "September 29, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Recently I got issue unlock my Kevo with my phone. I have to carry physical key with me because very often I need to use the physical key to open the door after standing outside my door for minutes with several failed touch-to-unlock with my phone. Bad product."}
{"Author": "", "Date": "September 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The app doesn't work with a Sony phone. Very disappointing. The lock works with my Samsung and my daughters iPhone but not my husbands Sony.  I am in Australia and we can't get Kevo Plus either.  If I had known all this before forking out $300 I would have bought the Samsung lock.  I can't even get a response from Kevo support regarding Kevo plus."}
{"Author": "Chris Smithson", "Date": "September 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Can never register my kevo first gen. It generates an ekey, and then tells me there is no internet connection, over wifi or cellular lte..."}
{"Author": "Abe lincoln", "Date": "September 24, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It randomly updates and does not up dat flagship devices. Making the non compliant and in usable . epic fail."}
{"Author": "Chris Cecil", "Date": "September 17, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Please enable for Galaxy Note 8. Says device not supported when launched."}
{"Author": "Raul Ortiz", "Date": "September 18, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I don't understand why Android support is hit or miss. No note 8 support?"}
{"Author": "Derek Norfield", "Date": "October 3, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "A bit temperamental but so much easier than groping for key while carrying \"stuff\""}
{"Author": "Diego Terzano", "Date": "October 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Terrible piece of software. Works intermittently, crashes constantly (on 7.1.2) and it is frustrating to use."}
{"Author": "James Carter", "Date": "October 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not work with Android Oreo. I feel like I wasted my money on this lock."}
{"Author": "Tori Cantales", "Date": "October 13, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Half the time it doesn't want to connect to our lock and we have to spend forever trying to unlock it... Idk if it is our app that is not working or something wrong with the lock itself"}
{"Author": "Richard Ferguson", "Date": "September 16, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Was able to email a key to a guest so they could enter the house before we got there. Worked great, no problem at all."}
{"Author": "lisa morgan", "Date": "September 16, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Try to modify an ekey &amp; the app crashes. Galaxy s8+"}
{"Author": "Gary Rocklitz", "Date": "October 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not work on LG V20. Does not work on Samsung Note 3."}
{"Author": "Matt Gallagher", "Date": "September 17, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Improve battery usage! No reason that it has to use N + 1 when running in background."}
{"Author": "Roslyn Hearne", "Date": "September 19, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Says that update is required on my Galaxy S6, but will not update.  Will not allow me to assign any other keys.  Sucks!"}
{"Author": "Derek Gleaves", "Date": "September 21, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Doesn't work really with my Samsung Galaxy S8+  seems to work well with the fob or other phones"}
{"Author": "Chris Gates", "Date": "September 12, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "No Note 8 support. Dumb."}
{"Author": "William Su", "Date": "September 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome and easy to use. The setup is a bit of a nuance but once you get over the update everything runs smoothly."}
{"Author": "", "Date": "September 30, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Fix this lousy app already FFS"}
{"Author": "efren garcia", "Date": "October 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not work on galaxy S5"}
{"Author": "Brandt Crosby", "Date": "October 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't wirk consistently at all!!!"}
{"Author": "Sean Greene", "Date": "September 14, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Did the Oreo update and lost functionality on my Pixel XL"}
{"Author": "Miguel Gil", "Date": "September 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Yes kevo now working on my Note 8 confirmed on my mom's my dads and my sister's note 8 also 😀😆😆👍👍👍"}
{"Author": "Justin Buzzio", "Date": "September 12, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Please add Bluetooth support for samsung s8 and s8 plus"}
{"Author": "Jared Brown Rn", "Date": "October 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Switched from Note 4 to Note 8, seemless transistion.  Never had an issue with Bluetooth or Kevo plus"}
{"Author": "Robert Lopez", "Date": "September 21, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Where is the Note 8 support? This is a flagship phone!!!"}
{"Author": "Alvin Tan", "Date": "September 17, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Unable to update the dashboard."}
{"Author": "Shun", "Date": "September 12, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "pls add support to sony xz premium"}
{"Author": "Scott Foster", "Date": "September 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "This app has just worked for me."}
{"Author": "Konrad Kwiatkowski", "Date": "September 30, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Just installed and works perfect!!! Love it. Best thing money can buy!!!"}
{"Author": "Dante J", "Date": "September 19, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Really?? No Note 8 support"}
{"Author": "Corwin Hill", "Date": "September 13, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works for me s8"}
{"Author": "", "Date": "September 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Legit!"}
{"Author": "Tara Amy McAdorey", "Date": "October 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Does the job."}
{"Author": "Chris Josiah", "Date": "September 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I wish it locked quicker... otherwise, PERFECT!"}
{"Author": "Esteban Garcia", "Date": "September 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great on my OnePlus 5"}
{"Author": "Franko M", "Date": "September 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Takes forever to connect. But convenient."}
{"Author": "Carl McGowan", "Date": "October 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works well"}
{"Author": "Ryan Edmundson", "Date": "September 21, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works great!  Well done!"}
{"Author": "", "Date": "October 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "88% reliable. Better than most."}
{"Author": "Rachel harding", "Date": "October 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Never works"}
{"Author": "Jennie Alexander", "Date": "October 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great app great system"}
{"Author": "Maurice No", "Date": "September 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So convenient!"}
{"Author": "", "Date": "September 30, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Really nice app"}
{"Author": "Joseph Smith", "Date": "October 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it more everyday"}
{"Author": "Ricardo Morales", "Date": "October 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works perfectly"}
{"Author": "Richard Lillie", "Date": "October 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love the concept"}
{"Author": "Greg L", "Date": "May 18, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "This app has come a long way. The lock/unlock signal travels much faster now. The low battery notification is nice as well. Only thing i wojld syggest is a manual refresh button yo see if the deadbolt is locked right this moment. It nirmally refreshes at a certain interval. 5min?"}
{"Author": "ToMMy BoY", "Date": "June 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Installation was easy, and the setup was painless. When I downloaded the app, it initially stated that my Galaxy S6 Active wasn't compatible, but I was still able to calibrate both it and my key fob with no problems. The software update downloaded and installed successfully as well. Now I love my new door lock. Just don't keep your key fob anywhere close to the lock, and you won't have any issues to deal with."}
{"Author": "William Hart", "Date": "July 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Garbage. Takes too long too access the lock so I'm standing in front of my door waiting for my phone to pair. The people I send a key to have to dowbload the app and make an account to use the key... How annoying.   I'm returning my lock and going with a Yale keyless entry model that ive used before with far greater success.   Final words, great idea, terrible execution."}
{"Author": "silox x", "Date": "May 31, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I had high hopes for this app since I purchased my Kevo lock (which I love).  Unfortunately the app says my phone isn't fully supported and I cannot use the touch to unlock feature or ekeys which is what I was interested in.  The problem is my phone is a Samsung Galaxy S5 which is supported and I use other BLE/BT4 devices such as the tracking tags named 'Tile'.  Not sure why my phone is not detected properly, I would really like to use this app and give it a great rating.  If anyone knows of a way to resolve this lemme know, I'd appreciate it!"}
{"Author": "Chris H", "Date": "September 9, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "When I first installed it. It linked up right away. Then within 5mins, would not find it again. It just Continues to search until it times out. I reset and linked it again. It worked fine for a day. Now it's back to searching.  What's the point of buying this product when I'm still going to use my keys everytime. Why do companies release buggy products that don't work. Returned. Going with schlagë"}
{"Author": "Matthew Bartlett", "Date": "May 31, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Worst designed app/lock on the market.  Why would you make a lock or app where only 2 functions work on majority of Android phones? This is just ridiculous.  The lock is a waste of money, the app doesn't work. One fob for a household and only 2 ekeys  for the cost of the lock.  That's a complete ripoff.  Plus no support in Australia. Have serious issues just connecting via Bluetooth. Waste of money and time"}
{"Author": "David Kha", "Date": "June 28, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Just upgraded to a 2nd Gen Kevo, and right away it works much much better than a 1st Gen Kevo. Kwikset should just recall all 1st Gens due to how unreliable it is. With a 2nd Gen Kevo the app (and fob) works almost instantaneously and reliably. A 1st Gen would always take forever and only work 30% of the time, requiring multiple retries or use of a physical key. The only issue that needs to be fixed is Android Wear 2.0 compatibility (force closes on Moto360)."}
{"Author": "Usunique L", "Date": "July 7, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It works on the phone with some errors, but doesn't work at all with android wear. Only an error message for that. I don't think the company try to update or improve their app so there are a lot of issues."}
{"Author": "Alaina Leighton", "Date": "September 6, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Slow to connect, I stood at my door for 5 minutes waiting for it to connect to unlock. Also having problems connecting with multiple devices. It's incredibly slow for all devices to unlock or lock. We have 2 Samsung Note 5's and a Samsung S7 Edge. We uninstalled the lock due to it unlocking itself. Reinstalled after we moved. Still worried it will unlock itself after I walk away like previously. Well probably try to convince husband to go with different wireless lock that's faster and less risky."}
{"Author": "james thompson", "Date": "August 16, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Would like to have it connect to my android wear watch at some point again.   I think this lock works great. Sure it has glitches. But for those drilling out their locks carry your dam 🔑 too, they do supply one with the lock. Or be more patient with it"}
{"Author": "J G", "Date": "June 6, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Great doorlook. Works with my phone Note 4. But all features don't work with Note 3. Also wish I could check on lock remotely without having to buy the WiFi link. I gave my wife the key fob since the touch feature does not work with her Note 3"}
{"Author": "Phillip Carroll", "Date": "July 18, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "This app works well with my Weiser bluetooth lock.  My LG G6 works with touch to open feature although the app showed question marks. A call to support revealed the instructions were outdated and the tech was able to help me program the phone correctly. 4 stars because of under developed android support.  I can't get the touch to open feature to work with the LG G4 even though it is Android Marshmellow 6.0 and Bluetooth 4 compatible. 5 stars for better android support and functionality on phones that are hardware capable."}
{"Author": "Marcus Thomson", "Date": "August 12, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Works great with my phone on Kevo 2nd gen, but still not connecting to Moto 360 via Samsung S8+. Support is non-existent as I have sent 2 emails with screenshots. They send me the same garbage that I have tried 5 different ways of uninstalling this and Android Wear with no positive results."}
{"Author": "David Hill", "Date": "August 8, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Had some trouble getting started. Had to use my daughter's iPhone to do initial setup which included updating lock software. Was then able to log in with my LG V20 and use the lock. Android compatibility is limited which I don't understand with 82% of phones running android os."}
{"Author": "Grant Jack", "Date": "August 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Not only does this app just flat out not work properly, the product itself doesn't work properly and might be the most frustrating  home product ever created.  Unless you like approching your door, putting the kid down, your bag down, rifling around trying to find your phone, opening the app and then the door only opening 10% of the time after waiting 60 seconds for everything to sync up...this product isn't for you.  Good idea...F on execution."}
{"Author": "", "Date": "June 6, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It works fine.  Sometimes it gets confused and loses ability to unlock with phone.  Restarting Bluetooth on phone resolves it.  Wish it didn't do that.  Ever since android wear updated to 2.0, I can't get the app to link with watch, so can't unlock with watch anymore.  That's a bummer."}
{"Author": "Roman", "Date": "June 24, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Auto logout is bad. You should add option in settings to disable or enable this function.  Sometimes you just stay by the door and retype again password to close or open the door."}
{"Author": "Reggie Holder", "Date": "August 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "How can this app be limited to so few phones. Really wanted this lock but wont work. Kind of sad they don't put more effort into the app."}
{"Author": "christopher e m", "Date": "July 22, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "I have tried so hard to support Kevo, and they have made a good product. But why haven't they certified more phones after all this time? My 2014 HTC M8 wasn't supported, my 2015 M9 was lost and replaced by insurance with a 2017 LG G6 which uses the latest BLE specifications, but hasn't been certified by Kevo. This is so disappointing...I keep trying to support this product but they seem to have given up on it."}
{"Author": "cody rager", "Date": "July 15, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "The app is very minimal.  Basic functions that should be present such as seeing the lock status on the hone screen, widgets, and any customization are absent.  The honeywell connected feature is worthless since it thinks anytime a door is locked that you are away.  I wanted to like this app and with improvements it could be good, but in the current state it is way behind its competitors in terms of features"}
{"Author": "Casey Biemiller", "Date": "June 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "On newer versions of Android, you likely need to give location access permission in the settings of the app in order for the app to work. My Moto  Z Force Droid isn't listed as supported, but works just fine after I make the change. The developer needs to add a prompt for the permission so people don't have to dig in the phone's settings, but other then that, I have had no issues."}
{"Author": "Ryan Heritage", "Date": "June 16, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Smart phone keys don't work. Garbage Bluetooth key. Takes forever to even get it to connect just for it to fail. Totally pointless smartphone app. Should just offer more key fobs in package and lose the app."}
{"Author": "James K", "Date": "September 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "My phone is Bluetooth smart (ready) but my Kevo is Bluetooth stupid. I can't even get to the install section (says it needs my location and locks up). Sure my device says it's not fully supported, great excuse for a poor app. Unfortunately too late to return this junk to the store... And after watching some YouTube videos not even sure if I want to user it as a deadbolt anyway."}
{"Author": "", "Date": "June 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Was having trouble connecting and getting an error message, once I reset the kevo device and tried connecting I was up and running! Bought this for my wife's business as she always has her hands full when arriving to work(She has the key fob) and she loves it and now so do I!"}
{"Author": "Jodaye Stuart", "Date": "June 13, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Won't let me see who is using the keys and when, this is the reason I bought it. The bluetooth works fine, but fix the \"history\" so I can see who is coming in going... It used to show me?... Update... Still not, showing history consistently... Crappy ap"}
{"Author": "David Hyman", "Date": "September 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I don't know what happened but the lock simply doesn't work with both the iOS and Android apps. I have reached out to their support and they are completely unresponsive"}
{"Author": "Waldemar Filipczak", "Date": "August 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Not working very well on Android 6. Have to log in into my account few times a day because the app logs me out. Another thing is that you have to wait for long time before it pairs with lock (if it pairs at all !) Waste of money."}
{"Author": "Sean R", "Date": "June 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "HTC bolt, moto z force, all my device are incompatible? Update your app so I can use my lock to get in my room!"}
{"Author": "Mark Concannon", "Date": "May 25, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "App is consistent and works well.   Hardware/ lock has some minor issues and doesn't track physical key lock/unlock. The whole package is great, otherwise."}
{"Author": "Ur Nan", "Date": "September 23, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This app and product is garbage. None of my new phones work with my old locks and I'm stuck using my old phone as a key. When the app works, which is rarely, it is slow and unresponsive. Will never buy one of these sad excuses for a \"smart\" lock again."}
{"Author": "Michael Harris", "Date": "September 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Do not purchase under any circumstances. The lock is as unresponsive as the company's customer support."}
{"Author": "Nicholas Cotton", "Date": "September 4, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Works very well with Samsung Galaxy S7 Edge. However has stopped working with Android Wear as of 2.0 - always crashes trying to configure LG Sport watch."}
{"Author": "Fred Brown", "Date": "June 21, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I should have read the app reviews before I bought this expensive lock. How can you only support a handful of android devices?   and Android wear support is still broken!"}
{"Author": "Aaron Wallace", "Date": "June 20, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as I would expect. The instructions said it would not be compatible with my existing lock however it came with everything I needed even if I had no existing lock. The app started off a little finicky due to the verification process. Just remember to close the app after completing the verification process then opening it and starting your ekeying procedures. I use the same account on both my phone and my wife's phone so I did not have to generate another set of keys however this may cause me issues later, I guess I will find out. I love the fact that it does not connect to the Internet so it being hacked is less of a worry. Locks do not need access to the internet due to your phone being able to program them locally and you can email the ekey to someone if they need to get in without you being home. I have not tried this yet but hopefully will soon. The only issue I have at the moment is the possibility of your phone being too close to the lock while being home which can allow someone to walk up and unlock your door if your phone is too close. That can be solved by simply turning off your Bluetooth while at home but that is not something people will like to do. So far it works great with no issues."}
{"Author": "Andrew Hogg", "Date": "May 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Didn't work at all!  Created an account and every time I got a verification email it wouldn't work. Horrible and I will never own one of these ever again."}
{"Author": "Joshua Todd", "Date": "September 18, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I have a galaxy s8+. Easy to use but not as sensitive as I would like.  My girlfriend has an iPhone 8 and the app does not run in the background so u must open the app every time. But over all the lock works great and the app is pretty easy to use."}
{"Author": "Chiu S", "Date": "July 1, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Installation instruction was nice. Too bad it won't let me resister my phone."}
{"Author": "Christian Muzzio", "Date": "August 6, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Awesome!  Very easy to install.  Instructions are detailed and easy to follow.  Pairing was simple enough however pairing my wife's phone required me to send her an ekey which wasn't explained.  Also setting up the app requires that you give it location permissions.  No problem with that but the app should ask during installation instead of having to change permissions in settings.  This is a must have for anyone.  I love the ekey sharing feature.  I can give someone temporary access or revoke anytime.  Very nice!"}
{"Author": "Henry Yu", "Date": "September 8, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Updating stars back to a 4.  They may have update their phone list after contacting them.  Their CS responds pretty quick.  Please just make sure this don't happen again in any of the next update."}
{"Author": "Jeffrey Goodfellow", "Date": "June 9, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Issue connecting to lock since last update, galaxy s8+ takes almost a minute or more to unlock door."}
{"Author": "Imran Admani", "Date": "July 25, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Love the lock. But no longer compatible with android wear 2.0. Develop does not care to make updates"}
{"Author": "Trent Sanden", "Date": "August 24, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Have the time my phone can't find the lock. Have to restart my phone to get it to find the lock. Every phone we have has the same problem"}
{"Author": "Kevin Effingham", "Date": "May 22, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Getting your phone to work can be a headache but customer service helped a lot and once everything is in it's a blast"}
{"Author": "Jacob Webb", "Date": "June 21, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "This is my second smart home Bluetooth device.  My first Bluetooth device for the smart home was a nightmare. So far everything functions great. I love it. Easy to install and figure out."}
{"Author": "", "Date": "June 24, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works well. The only downside is that it takes about 15-20 seconds (sometimes longer when you have a bunch of stuff in your hands walking up to the door) to get it to search and then lock/unlock the door. If my phone is always connected to my lock via Bluetooth (given it's in range. And it is), why does it take so long to do what this app was made for?"}
{"Author": "Jonathan Lemonde", "Date": "June 6, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "While the instructions and  interface are very clean, it does not support my Pixel on the latest version of android and therefore cannot be used. \"Could not connect to bluetooth device du to invalid pin or passkey\", yet inapp my phone cannot find the lock."}
{"Author": "David Blankenship", "Date": "June 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Want to unlock the door from work? You have to pay an additional $99 for Kevo Plus. Come on guys- this is a basic feature of a smarthome lock."}
{"Author": "Mathew McArthur", "Date": "June 30, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Lock was great and worked flawlessly until my partner and myself updated our phones (onePlus 5 and Sony Xperia XZ premium) now neither phone unlocks my door, turning it into a dumblock again. Not even my android wear watch opens it anymore"}
{"Author": "Josue D. Rodriguez", "Date": "September 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "#UPDATE  PLLLLEEAAASEEEE!!!! The app is not compatible with the Note 8.  Please fix ASAP."}
{"Author": "Taylor Sweet", "Date": "July 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Was good when we first got it, but now we always get locked out because it won't connect or something. Even when we change the batteries to new ones..."}
{"Author": "Becki Wins", "Date": "July 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't always work...takes too long...could have been murdered in the amount of time it takes to open the damn door....booo"}
{"Author": "Chantell Williams", "Date": "May 30, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "The only problem I have is you have to be standing right in front of the lock to use but when I'm in the house  I can use it from anywhere. I also thought I will be able to lock and unlock from anywhere even if I wasn't in the same state"}
{"Author": "Stephen Hope", "Date": "July 26, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "When i switched phones i dreaded setting up  my new to the lock , so i just didnt use it  for awhile  but my phone kept finding it in my Bluetooth  menu so i  went ahead downloaded the app, signed in  the first time i touched the lock it was working .. already set up .. impressive .."}
{"Author": "Knotty Hotti", "Date": "July 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "A lot of the time it leaves me locked outside even when I go inside the app n let it search find the lock and unlock it from there the phone will say unlocked but the door is still locked"}
{"Author": "Joe White", "Date": "July 23, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Attempting to pair the device with my Galaxy8 phone gets me a warning:  \"Needs Location to Pair\"; without a link or way to allow the app to know my location. Just gets stuck on that screen. So I have a $229 paper weight."}
{"Author": "Joe Cruz", "Date": "September 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Until now everything is perfectly fine, but now that I got the Android Oreo update on my pixel I'm getting a notification that I can't turn off, if you guys please can go over it, I'll appreciate it."}
{"Author": "Travis Curtis", "Date": "June 3, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I would give it 5 stars, but I just remove someone's access and they still can access my house through Kevo.  Is there anyone else having  this problem?"}
{"Author": "Michael Asperger", "Date": "September 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Installation went well, had trouble pairing my android device until I did a lock reset.. so far it works ok. Cant get Android wear to work at all, but no big deal for the moment. Updates will follow in the future."}
{"Author": "Jordan Means", "Date": "August 16, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "App stays running even if you go through in manually close it and choose up battery have to sign out on an Samsung S7 to make it stop running. Very slow compared to iPhone"}
{"Author": "Jeffrey Lewis", "Date": "August 23, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Lol, you can't even create a profile. It just says creation unsuccessful. Trash."}
{"Author": "John Zila", "Date": "August 16, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Often doesn't connect to the lock. Using a guest key requires not only installing the app, but creating a Kevo account. That completely destroys their utility."}
{"Author": "Roger Fowler Jr", "Date": "October 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Intrusive and poorly designed.  Constant notification on your phone that says \"your Kevo is running\"... No kidding, it'd better be, for the huge cost of the thing!  I shouldn't have to deal with your advertising when I've paid you hundreds of dollars got a product I'm literally using multiple times everyday anyway!  If you block the stupid notification then you can't get notifications about lock events.  And, BTW, it forces you to receive [useless] emails as well as push notifications for those events.  AND you have to set up each event (lock and unlock) separately for each individual key-holder!  Even being the best most convenient smart lock on the market they make it very hard to justify paying their insanely high price for the thing with this absolutely garbage app.  Oh and BTW it doesn't work with Google Assistant like the rest of their smart locks, and everyone else's, for that matter."}
{"Author": "Kathy Andria", "Date": "June 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "My sister is having a knee replacement and I am having back surgery. With the camera doorbell with intercom, we are able to see who is at the door and open it without having to get up and walk to it. I am getting the same system for our parents!"}
{"Author": "James", "Date": "July 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Panders to iphone users gimped on android would only let ne manage ekeys nothing else on either the lg g3 or g4"}
{"Author": "Geoff Kaplan", "Date": "May 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as expected wish it was more like a car sometimes its slow to unlock."}
{"Author": "Barbara Lewis", "Date": "June 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Don't even have to think about it.  Can have my phone in my back pocket, touch the lock and it instantly opens!  Easy to send EKeys to vendors or guests.  Have had absolutely no problems with this app!"}
{"Author": "Jason Ainslie", "Date": "July 23, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "It says that the location is needed for setup yet my location is on. I can't pair my Samsung 8 with the Kevo. What a waste of money."}
{"Author": "John Cornelius", "Date": "June 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Like it but a little annoyed I have to spend $100 for a device that should have been included at a price point of $240"}
{"Author": "Kobi Laredo", "Date": "June 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great on my Pixel XL - a bit slow to unlock but other than that it's pretty solid."}
{"Author": "Dereck Williams Sr.", "Date": "June 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Very very excellent and easy to use app. I'll advise anyone that has a smartlock system installed in their home to use the KEVO app to work it you will not regret the decision to do so....."}
{"Author": "kosta rica", "Date": "September 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "The lock and unlock works very well I would love if it locked and unlocked automatically when I walked up to and away from the door. Also I just installed it so if it does props"}
{"Author": "Billy Wheeler", "Date": "July 18, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It works really well from my phone, but the phone refuses to activate Android Wear so that it will work from my watch."}
{"Author": "Johnathan Hendsbee", "Date": "August 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Not happy will not work with my phone LG G6 big waste of money"}
{"Author": "Cheyne Honeyman", "Date": "July 10, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Keeps duplicating events every 20 seconds or so and causes the phone to vibrate. So annoying"}
{"Author": "Jeff P.", "Date": "June 26, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work with s7 stuck at location enable error when setting up lock"}
{"Author": "Yari S", "Date": "August 17, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Takes too long to connect to the Lock to be able to unlock or lock door. Need a better way to connect also to skybell add a button to unlock and lock through skybell alslo.. Using kevo convert with samsung s8"}
{"Author": "John Craig", "Date": "July 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy installation of the core system. Great instructions. Getting the Plus to like up was a bit tricky but pretty easy in the end."}
{"Author": "Mike Pantoja", "Date": "August 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Trouble with setup but after update it works just like I hoped.  Keeping it."}
{"Author": "c carey", "Date": "July 25, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Had issues finding how to open location to the app: error message was cryptic."}
{"Author": "Rafael Mirabal", "Date": "September 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Got this lock about 9 months ago it works great. I had the galaxy S7 edge  and now I have the note 8 and it works great with both phones. Great product! Recommend it to everyone."}
{"Author": "Fabian Tan", "Date": "July 20, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "This app conveniences my business. Not only can I open the door for someone when I'm 100000 miles away. I also know what time my employees arrive and leave work."}
{"Author": "Eric", "Date": "August 21, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This is a joke. Wasted money on this lock as app still dont work"}
{"Author": "Sam Johnson", "Date": "May 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "As long as you follow the directions to set it up this lock is awesome. Never fails me or my wife."}
{"Author": "Brandon Hall", "Date": "July 30, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "On Android O beta the lock rarely unlocks with my phone in my pocket. This was not an issue with Android N"}
{"Author": "Vijay Mahapatra", "Date": "July 19, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Nice lock to impress someone visiting  . But need to be  more reliable  it unlocks  6/10 time in one attempt .  Kevo plus Alexa integration is great ."}
{"Author": "Kerry Minor", "Date": "September 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work on Samsung S8 phones!  Are you kidding me?!"}
{"Author": "Keith Ciero", "Date": "September 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "3 hours of my life wasted on this trash. Avoid it like the plague!! Returned!!!!!"}
{"Author": "Bradley Scalio", "Date": "July 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Actually works fairly well, only thing is you have to manually set app permissions there's no ask when installed."}
{"Author": "Wren Scheidl", "Date": "September 7, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "It's a little clunky but gets the job done."}
{"Author": "Matthew Kegerise", "Date": "August 5, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "After upgrading the lock to a kevo kwikset v2 and performing the software update on the lock it works very smoothly.  Love it. I was hoping it would have support for Google home."}
{"Author": "Bill Roth", "Date": "June 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "messes up voice quality when on conference calls over Bluetooth. Please fix"}
{"Author": "Saela Sae", "Date": "July 6, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Took forever to set up. Thank god I'm not in a scary movie or I'd be dead. It takes entirely too long to lock or unlock."}
{"Author": "Wuji Fei", "Date": "July 29, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Convenient, works most of the time, updating the firmware could be a hassle at time, but overall I can't go back to a lock with a key!!"}
{"Author": "Joe Bright", "Date": "July 11, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I like it it works great i just wish the keyhole wasn't made of plastic and It didn't coat an extra 100 bucks for kevo plus"}
{"Author": "Simon Puzankov", "Date": "July 8, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "sometimes doesn't work on the first try"}
{"Author": "Martin Silvera", "Date": "August 4, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Nothing but good things to say about this, works like a charm while making life easy."}
{"Author": "", "Date": "September 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great remotely and Kids love the idea of not needing a key. And I get to revoke access whenever I want. ;)"}
{"Author": "Mark Sergent", "Date": "July 30, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Newer version much improved. Finally able to get my gateway working."}
{"Author": "Phil Schopieray", "Date": "June 27, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Initial down load said m MotoZ wasn't comparable but after the super installation it connected and works great..."}
{"Author": "Carolyn Carrington", "Date": "July 6, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Easy to install and had no issues using the app. The ekey doesn't seem to working with samsung note 5 ."}
{"Author": "Roy Gonzalez", "Date": "May 30, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It would be 5 Stars if can set push notifications of door being unlocked for a certain amount of time."}
{"Author": "John Lacson", "Date": "July 30, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "No longer works on Android Wear 2.0"}
{"Author": "Bob Angel", "Date": "July 22, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Need to fix constant update errors"}
{"Author": "Ting Lu", "Date": "June 6, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Takes multiple trys to pair with the lock. Android wear is not workings"}
{"Author": "Tanyale Carter", "Date": "September 10, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great for me! I love my Kevo! It works flawlessly with the Samsung Galaxy S7 &amp; now my Samsung Note8."}
{"Author": "", "Date": "May 29, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Everything is working so far, easy to install. Takes a little time to update but works great!"}
{"Author": "Ezra Goldberg", "Date": "July 9, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not work with Android O."}
{"Author": "John Armbrust", "Date": "June 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I no longer have to give out my keys and I know who is coming and out even when I'm not home."}
{"Author": "", "Date": "May 20, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "It takes so long to find on bluetooth to unlock"}
{"Author": "Andrew Eggleston", "Date": "July 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works well.  Got it on exterior doors.  Have not locked myself out since"}
{"Author": "Wil Largen", "Date": "September 13, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great way open the door without using a key."}
{"Author": "Athena Eilebrecht", "Date": "September 15, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Pretty good but it needs to get faster It takes forever for it to connect. Otherwise it's awesome"}
{"Author": "Teargas Horse", "Date": "July 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "After 3 years, I can finally control the lock with Android...yay!"}
{"Author": "Andrew H", "Date": "September 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Pretty great lock. Good to be key free and be able to lock my front door at night from anywhere in the house."}
{"Author": "Chris Ellis", "Date": "June 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Flat out awesome, so far works great and is very secure"}
{"Author": "Bill Keas", "Date": "May 31, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Sometimes slow to connect to phone but good so far"}
{"Author": "Deniz Okten", "Date": "September 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Android oreo, app always running in background"}
{"Author": "Ted Brassfield", "Date": "June 3, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Sometimes takes a minute to connect to the lock, but normally works quite well."}
{"Author": "Richard Bedard", "Date": "July 16, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't  connect, say I need a location"}
{"Author": "Darlene", "Date": "June 26, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It's nice but update never works"}
{"Author": "Aaron Sykora", "Date": "August 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Very convenient and high-tech! I'm very happy with this product."}
{"Author": "Barry Casey", "Date": "September 22, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Don't forget to your Bluetooth!"}
{"Author": "Riz Panjwani", "Date": "August 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work."}
{"Author": "Brian Seiffer", "Date": "July 8, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "30% of the time it functions as it should."}
{"Author": "kilgorequinlan", "Date": "August 18, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works so far!"}
{"Author": "Rob Hall", "Date": "September 30, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I love it. It makes sure I remember to carry my phone to and from car."}
{"Author": "TheMech456", "Date": "August 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Needs Improvements for Android phones!!!!!"}
{"Author": "Decibel Car", "Date": "May 21, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work"}
{"Author": "Charlene Chames", "Date": "September 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I do like it.  More time to sync phone then install."}
{"Author": "kofi armah", "Date": "August 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great device have not had any issues at all."}
{"Author": "Aminu Usman", "Date": "June 29, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "The product is so durable and easy to install n handle"}
{"Author": "Werner Morales Padilla", "Date": "June 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Loving the unit. I think it needs faster response times."}
{"Author": "Ron Baker", "Date": "August 30, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as it's supposed to"}
{"Author": "Joe Nichols", "Date": "June 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great from phone  Fob has to be very close"}
{"Author": "Cade Hodapp", "Date": "July 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Its a good way to keep your doors locked"}
{"Author": "Bruno Herrera Pelayo", "Date": "June 27, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works as intended."}
{"Author": "Sal Novin", "Date": "October 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works!"}
{"Author": "", "Date": "June 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I love the way it keeps me informed."}
{"Author": "Sam Wybenga", "Date": "July 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I love the fact that I don't need keys."}
{"Author": "Shawna Bergen", "Date": "August 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works well."}
{"Author": "Yvan Thornhill", "Date": "August 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works really well easy to set up"}
{"Author": "ARISTOTLE VENTURA", "Date": "July 25, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Serves its purpose... Would wish for more compatible phones...😒😒😒"}
{"Author": "Marvin Corro", "Date": "May 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "This app is is neat"}
{"Author": "Legendary Goku", "Date": "August 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Best thing ever"}
{"Author": "Gus Chakalakis", "Date": "September 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great on my nexus 6p."}
{"Author": "Sergio Contreras", "Date": "June 12, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Like it, but needs work!"}
{"Author": "Robert Alvarez", "Date": "July 13, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works fine on my LG V20"}
{"Author": "Jeff Wurzer", "Date": "July 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Usually works"}
{"Author": "Victor Rupert", "Date": "June 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Does what it says"}
{"Author": "Brian Hoke", "Date": "July 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Pretty simple app. Does what it should."}
{"Author": "Rebecca Parker", "Date": "July 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Install was easy... setup was easy.. love the ease!!"}
{"Author": "Charles Jeune", "Date": "June 22, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great and it's so convenient"}
{"Author": "Everett Scott", "Date": "June 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So far, so good!"}
{"Author": "Victor Martin", "Date": "May 22, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great, easy installation"}
{"Author": "Ted Moore", "Date": "July 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy install, great features"}
{"Author": "Imran Singiwala", "Date": "June 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's good and does the job"}
{"Author": "Jessie Arsenault", "Date": "May 19, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "So far very good."}
{"Author": "Derek Conley", "Date": "September 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Very convenient and easy to use"}
{"Author": "Ramsey 233", "Date": "June 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love the ease of use!"}
{"Author": "Katherine King", "Date": "July 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works better than it used to"}
{"Author": "Mike Malcomb", "Date": "August 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy to install and works well"}
{"Author": "Leston James", "Date": "June 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Loved it. Kwik and easy. Lol"}
{"Author": "Pablo Moyano", "Date": "August 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Super easy to use!!"}
{"Author": "ALEVLOGS HD", "Date": "July 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Excelente application... Love it.. Hands free..."}
{"Author": "Jason Shepherd", "Date": "August 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great for me."}
{"Author": "", "Date": "August 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Best, lo mejor"}
{"Author": "Sarah Truemper", "Date": "June 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great App!"}
{"Author": "Hur Henry", "Date": "June 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Very Easy to use"}
{"Author": "Fred Michanie", "Date": "May 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy to use and reliable"}
{"Author": "Gabriel Jimenez", "Date": "July 28, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Great door lock"}
{"Author": "Manasseh G", "Date": "September 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Exactly what I need"}
{"Author": "JP CASH", "Date": "August 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great smart lock"}
{"Author": "John Baggott", "Date": "July 10, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Just nice!!!"}
{"Author": "Mr. J Jingle", "Date": "August 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Freakin' awesome"}
{"Author": "Viller Hamilton", "Date": "July 31, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Work's fantastic"}
{"Author": "Devon Friedman", "Date": "July 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's amazing"}
{"Author": "Andre De Cohen", "Date": "May 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Really good."}
{"Author": "Wgamer Starnes", "Date": "July 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's awesome"}
{"Author": "Arieh Katz", "Date": "August 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great!"}
{"Author": "Michel Lessard", "Date": "June 14, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Pretty ingenious...."}
{"Author": "Ahmed alsabri", "Date": "July 12, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Not bad"}
{"Author": "Shawn Smith", "Date": "May 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Reliable and convenient"}
{"Author": "Brandon Blomquist", "Date": "May 30, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works awesome"}
{"Author": "Fruit Beast", "Date": "June 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great"}
{"Author": "Tom Wright", "Date": "July 22, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Great device"}
{"Author": "Nick Tabbi", "Date": "May 20, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome lock"}
{"Author": "", "Date": "June 10, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great"}
{"Author": "eric skiver", "Date": "July 23, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works good"}
{"Author": "Candelario Cabrera", "Date": "September 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy to download"}
{"Author": "William Piper", "Date": "September 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great"}
{"Author": "Jon Leland", "Date": "August 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Simple and reliable"}
{"Author": "William Byrd", "Date": "September 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome app"}
{"Author": "Hilery Avritt", "Date": "May 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it."}
{"Author": "Sagar Patil", "Date": "August 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Amazing."}
{"Author": "Chris Starchok", "Date": "June 17, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Amazing"}
{"Author": "mega gani", "Date": "July 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome"}
{"Author": "Jason Godbey", "Date": "July 13, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Brilliant"}
{"Author": "Bryan Nichols", "Date": "July 20, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Cool"}
{"Author": "Chriss Raudales", "Date": "August 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome"}
{"Author": "Ben Leypoldt", "Date": "August 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it"}
{"Author": "Avid Pauly", "Date": "October 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it"}
{"Author": "William Giandoni", "Date": "May 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This is a garbage system. I walked out of the house brushing the lock, activating then. Then I touched the lock again and it said the battery was low. I touched it a second time and was prompted to update to a newer version. I go to update and you have to remove the cover and hit the program button. Easy enough if you are in your house! I habe had this system for over a year and it is garbage. Spend your money on nest or something else."}
{"Author": "Lisa Faught", "Date": "May 16, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "I paid alot of money for a door I have to use my key for anyway. At first I was having problems with it locking me out. But I fixed that by making sure I did not leave my phone within 50 feet of the door and I turned on the tap three times to lock. I think I would like this better if it was WiFi and could connect without having to purchase the additional bridge."}
{"Author": "Mary Miller", "Date": "March 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I have this app installed on a Note 5 and a Pixel and they both have horrible bluetooth connectivity problems. I was so excited because the newest update allowed installation on my Pixel, and while I can lock/unlock within range, I can't update the lock. My Note 5 won't connect at all to lock/unlock or update. So so so frustrated that my $200+ lock isn't working as it's supposed to because of these app problems."}
{"Author": "Curtis DeBolt", "Date": "March 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The app or website does not let a signed in user reset their security questions. Horribly slow support when I contacted them about it, they did not answer my question or resolve it but instead just asked why would someone want to do that. Also this is a security issue if you can't reset your security questions, and yet it's supposed to secure my house?   Cannot update my own security questions."}
{"Author": "diana f", "Date": "May 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "My whole family enjoys the convenience of the Kevo 2nd gen and Kevo plus hub. I ran into issues trying to install the hub A: I am not the owner of the lock and B: the directions aren't very clear. We called customer service and they were extremely helpful and courteous. When the direction tell you to follow in app instructions. You must first push the + sign in the app to add the hub. No where and I repeat no where that I looked whether it was online or in forums did it say this. Since then we have had the hub hooked up for a week with no issues. We have been using the lock for 3 weeks. We did notice before the hub there was a little bit of a lag when locking or unlocking by Bluetooth but since it seems to be more efficient. The sending of ekeys is an excellent bonus we have used this option multiple times with no problems."}
{"Author": "L M", "Date": "March 15, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Terrible. I thought this would make my life easier. I hate that I have to have my Bluetooth on all the time. When I'm standing on my front to step searching for my phone then have to wait forever while it says 'searching, searching, searching...ERROR' I've never actually been able to use it the way it is supposed to work and always have to use my key. Just a $300 manual lock for my door."}
{"Author": "bob sarna", "Date": "May 17, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Ashley says it who t work with an Android. Ashley, it does. Another stated support it terrible. For various reasons I have called support. Might need to wait 5 or 10 minutes, but they were VERY friendly &amp; knowledgeable. I even emailed a couple questions and answers arrived in less than 48 hours. The locks work great, I swapped the batteries for the best i could find before installing the locks cause I'm smart...  Also, works great with Alexa (and add on unit). If you can Google, then there is no reason what so ever to say there are no I instructions or they are not clear.  The locks rock and so does their tech support."}
{"Author": "Ashley Davis", "Date": "March 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "My Husband bought me a Kevo for Valentine's Day and it apparently is not compatible with Droid devices. This absolutely sucks! I was so excited. Now I can't even use it?! Droid phones are just as popular as iPhones these days!!"}
{"Author": "Raymond sump", "Date": "April 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Takes long time to unlock. More often than not after unlocking door (if it worked for that at the time) would send deadbolt lock out just after opening door. Lots of flaws"}
{"Author": "William Hagerty", "Date": "April 3, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Really what I hate the most is you can't disable users. You have to remove and add them back completely. It is slow but only like 5 secs at most."}
{"Author": "Kathy DeLorenzo-Macalone", "Date": "March 7, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I really want to LOVE this.  I love the concept but it's unreliable,  and if the battery on your phone goes too low then it's totally useless.  Also,  I want to be able to disable or limit times for some users but not delete them.  Can't seem to do that.  But when it works it's great"}
{"Author": "R a Z o R Jenkins", "Date": "March 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great! Too bad my note 5 has weak blue tooth... my wife's LG phone works flawlessly... to those complaining about Bluetooth connectivity issues... I don't think it's so much the Kevo it's your device. Either way... great product cool lock!"}
{"Author": "Harold Rodriguez", "Date": "February 28, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "The lock works whenever it wants even after doing the calibration. At times it will not open or close unless the phone is touching the bolt and that is pointless."}
{"Author": "jesse shaker", "Date": "May 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I bought the 1st gen kevo.  When installed I was prompted to do a update. Which kept failing.  Called kevo, they said it was the unit and they were going to send me a REFURB IN REPLACEMENT.  A REFURB!!!. This is because they are back ordered for 2 months. My unit was brand new.  I brought it back to best buy and exchanged and paid the difference on a 2nd gen kevo that has the same issue.  It will not update and the app is useless.  I have a samsung galaxy s6 edge, Bluetooth enabled with sharing.  Great idea poorly made.  Very disappointing. Will be returning...  also their customer service reps have very little information that helps. Sorry kevo I was very excited but you disappointed me."}
{"Author": "David Fisher", "Date": "March 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "For Kevo locks. Great idea. Great looking design. Terrible lock firmware and terrible support for this app. The locks really don't behave as advertised. To actually control or monitor the locks remotely, you have to buy the overpriced Kevo bridge that is never in stock. For this app, it took them in excess of 6 months to support Google Pixels. Didn't bother to replace the batteries in the Kevo. Planning to swap out the locks with Schlage ones this summer. Also updating all the door hardware in the house. Will not by Kwikset anything ever again."}
{"Author": "Justin Lentini", "Date": "March 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Still want to love this but can't. It randomly works even after following all the troubleshooting tips and suggestions. Everytime I get this to be \"somewhat\" reliable there's either a firmware or software update then it acts up again. I guess I'm the idiot for thinking this will work better after updates. Still doesn't work to this date and I've owned this terrible manual lock since they came out with 2.0 version several months ago."}
{"Author": "Kiesha Edge", "Date": "April 2, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Takes a long time to connect to my S7 Edge but connects to my husband's 7 Plus pretty quickly. Does not register if door is locked/unlocked by key or by hand so you won't see that in the history (my child still uses a key). Sometimes when it connects it won't unlock (got stuck outside once without a physical key and the Kevo wouldn't unlock, late to work that day)."}
{"Author": "Auhsten Buckallew", "Date": "February 26, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't calibrate because the instructions are horrible. My phone set up on it to be the owner but hours later when trying to add a key the owner phone won't connect to it and the customer support is horrible and unclear. Horrible horrible horrible."}
{"Author": "Bryan Barnes", "Date": "April 29, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Not compatible with new phones. LG G6 does not work. Good thing I haven't installed this yet. Probably will hang onto it for a week then send it back if problem isn't fixed. So glad I read the reviews first!"}
{"Author": "Chris Knorowski", "Date": "May 3, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Sometimes the bolt will pop out when the door isn't shut or while the door is closing causing it to hit the deadbolt hard. Deadbolt should be arter than that. Somewhat slow to react to touch. Should be a better way to share keys. Extra keys are not free."}
{"Author": "Mike Palmer", "Date": "March 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Constantly turns my Bluetooth off on my pixel. You never know it did it until you are driving around on the road and need to use your handsfree. At which point, you have to fumble around with everything trying to get Bluetooth enabled and connected to handsfree without causing a pileup on the freeway.  Just. leave. my. Bluetooth settings alone! Just use it, that's it Kevo!"}
{"Author": "Jean Alvarez", "Date": "March 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo stopped working and it's infuriating. I hate standing outside my house for 10 minutes everyday until this stupid thing unlocks, sometimes it doesn't even unlock. It's pretty useless now."}
{"Author": "Scott B", "Date": "February 26, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "constantly having to take my phone out and then have to open the app to get my door to unlock. of I had known that, I would just fumble for my keys as it would be faster to get in my damn house. does not work consistently"}
{"Author": "", "Date": "April 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great on our S7 and J7.  No issues at all.  Installation took about 45 minutes mostly because I didn't read the directions completely.   Could do it again in 20."}
{"Author": "Josh France", "Date": "April 7, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "My deadbolt needs an update all of a sudden and absolutely won't open till I do it.. I'm trapped outside now.. I guess I'm breaking into my own house now"}
{"Author": "Donna Tencza", "Date": "April 17, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I have a Samsung Note 5 and it works perfectly.  No issues at all.  Possibly all the negative comments are user error.  I also installed one for a friend and she loves hers also"}
{"Author": "kyle corn", "Date": "March 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not work woth my Samsung Galaxy S7 edge... does not pair and always asks for Bluetooth to be turned on when I try and update the app...."}
{"Author": "Carlos S", "Date": "March 19, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Phone bluetooth connection needs major improvements, battery life is very short, rechargable batteries highly recommended, the Kevo fob is worth every penny but defeats the purpose, Kevo Plus is awesome, highly encourage the investment, it's the best part of the Kevo setup without the Plus I would give it a 3 stars"}
{"Author": "James Coulombe", "Date": "May 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Don't waste your money.  App doesn't pair with lock, terrible instructions, terrible app and worst design imaginable."}
{"Author": "Kyle Verry", "Date": "May 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I like it. It has needed a bit of coaxing, but nothing beyond a reinstall of software on one phone and replacing batteries one time. Have a first gen (2+ years) and a second gen (1 year). My parents now have one too, and it was a set it, forget it. Mostly Nexus and Motorola products. The iPhone always needs the app open....good thing the parents have Nexus phones!!! ;)"}
{"Author": "Matt Brennan", "Date": "March 5, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Nice recent update. Still missing: history of manual lock/unlock, wildcard notifications (you have to set them up individually for every user/event combination), better nest integration (set nest home/away status instead of adjusting temp)"}
{"Author": "Leandro Escobar", "Date": "May 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "The app doesn't work on three different up to date devices and the physical lock and fobs are trash. Waste of $200."}
{"Author": "Christian Simpson", "Date": "April 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Email listed right here doesn't work * No Wink support * Notifications hard to set up and flaky * Android Wear often says No Locks"}
{"Author": "Mike Smith", "Date": "March 10, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It is awesome...I am not a person that's here to hype up the comments, but it works perfect with my ring doorbell. I just wished it worked the same so I could be able to unlock the door for my children if I am not home"}
{"Author": "Kevin Cheung", "Date": "March 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works alright for me. Takes a little while for the app to lock and unlock. But aside from the app, it easily locks &amp; unlocks with a simple touch on the deadbolt. I just turn on my Bluetooth as I'm approaching my door and voila!"}
{"Author": "Ramon Bruzos", "Date": "June 19, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Not compatible with some phones Says the phone is not compatible, app needs some work. I do love the lock."}
{"Author": "Stephanie Keith", "Date": "March 25, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Has to be restarted once in a while. When you're standing at the door with your arms full it is kind of annoying,  but everything else works great."}
{"Author": "Matthew Salvatore", "Date": "March 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work with droid turbo. Lock only works with iPhone when app is open. Key fob doesn't always work. Eats through batteries on fob and on door. Highly recommend a different lock."}
{"Author": "Kenneth Gore", "Date": "May 19, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "The app has come a long way to echo others. Thx to the dev team. Keep up the good work! I would only ask for a way to backup the encryption keys so u dont have to reinitiate if something happens to your phone. At least the lock owner. Maybe only the owner actually;)"}
{"Author": "Elezar Kenig", "Date": "March 9, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I like the new app, wish there were more advanced notification options. Eg, I want it to always run in the background but I don't want a notification telling me about it. What if someone picks up my phone and sees that and now knows they can just get in?"}
{"Author": "Jerome Donovan", "Date": "February 24, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Doesn't work. Had been broken for many months with no sign of a fix. Depletes battery and can't uninstall"}
{"Author": "Chris Bowe", "Date": "April 5, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works well (for me). There are times I've had to reinstall the app to recalibrate the Bluetooth distance so it still works in my pocket. I've had this lock for around 2 years now and have NEVER used the physical key. Sometimes the lock is picky and flashes pink but I always take that as \"I recognize the device but didn't understand its location\" the devices way of not letting just anyone unlock your door with you inside."}
{"Author": "Mohammad Hassan", "Date": "April 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It runs in the background, if you think running your Bluetooth all the time is a hassle, then I suggest get rid of your iCrap and get an actual smartphone like a Samsung :)"}
{"Author": "Ryan Gordon", "Date": "April 13, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "It's a bit slow sometimes but this is my only issue.  Very good app otherwise."}
{"Author": "Romeo Guishard Jr", "Date": "May 4, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It was awesome in the beginning. Seems like it's getting worse as thinner goes on. Seems like Bluetooth issues."}
{"Author": "Scott Lev", "Date": "April 21, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "1800 troubleshooting was quick enough.. lock and app seem flawless upon testing all features  Give it an 8 outta 10 .. maybe 2nd Gen is out and home depot still selling first at full price .. buy on amazon"}
{"Author": "michael cavallo", "Date": "May 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Does not perform well. The phone has to be in my hand, very close to the deadbolt, and still takes 2-3 tries.  Complete waste of time and money."}
{"Author": "Jennifer Lawson", "Date": "February 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Finally got all the kinks straightened out, thank goodness! 5 star app at last!"}
{"Author": "Nate Weibley", "Date": "February 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "The 2.0 update and firmware update has made touch registration much faster. Also the accelerometer detection keeps the bolt from toggling accidentally while the door is moving now. New updates are overall great!"}
{"Author": "Tracie P.", "Date": "April 29, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "We have used Kevo for years and we will not go back to anything else!  Love the blue tooth capabilities and being able to send anyone a key.  So convenient!"}
{"Author": "", "Date": "May 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "It refuses to pair with my phone.  And support seems to be unavailable.  Too aggravating for such an expensive device."}
{"Author": "Angel Perez", "Date": "March 4, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love the ability to send ekeys for free now. I stopped carrying keys, with the exception of my car."}
{"Author": "Noella Soares", "Date": "March 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "The app works really well after the Nougat update."}
{"Author": "Adam Stadelmann", "Date": "April 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works great unless I have my phone in my back pocket.  Which is more a statement of the Bluetooth strength than the app or the lock.  We have it installed on 5 Nexus 5x's"}
{"Author": "Amanda Dormaier", "Date": "May 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I love it I have a s5 Samsung and have no problem but if you get it read the instructions other wise wires get pinched and it does not work"}
{"Author": "Del Gaunt", "Date": "April 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "It is so sensitive to touch if you bump it going outside it locks"}
{"Author": "", "Date": "March 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Kevo is great, I had the first gen and it worked for a while but the static shock you get when you rub feet on carpet screwed up the lock, now I am  using kevo convert with kevo plus and it works flawlessly"}
{"Author": "Julia Tucker", "Date": "May 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Front door done.  Work's so well we purchased a second one for the side door.  Next month will get one for the back door.  Love being able to cancel key's so easily too."}
{"Author": "Kenny Ng", "Date": "May 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "So many negative feedback.and u just ignore it.poor service.regret to get it.not recommended. I say again.not recommended!!!!!!"}
{"Author": "Tim \"TJ\" Jordan", "Date": "April 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "New update is awesome!  I can now remotely lock and unlock my front door from my bedroom or living room directly from the app.  Bluetooth connectivity is improved!"}
{"Author": "Jeremy Beamer", "Date": "March 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works every time. Great for when I am out running and don't have to carry a set of keys.  Friends can have access without adding another key to the keyring."}
{"Author": "Maurice Caviness", "Date": "April 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Working good so far....sometimes takes 2-3 tries to lock the door, but it does work. Only been using it for about 1 week at the time of this writing."}
{"Author": "Gus Sabogal", "Date": "April 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great. Third Lock I install with no problems. Had an issue adding a virtual key, tech support was awesome. No problems with my Android devices. Never tested with iPhone."}
{"Author": "", "Date": "March 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Support for Pixel XL makes it 5 stars. 😀"}
{"Author": "Kuros M", "Date": "March 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Class action lawsuit. That's all I gotta say."}
{"Author": "Warren champ", "Date": "April 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Modern-day conveniences. This devices offers ability to share with friends and family, just one tap from your smartphone! 📱"}
{"Author": "Dave Lindsay", "Date": "May 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Terrible lock, total junk, do not buy"}
{"Author": "Kim Rogich", "Date": "April 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Awful. Doesn't always open. Free keys don't work."}
{"Author": "Morgan Evans", "Date": "March 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work on Google Pixel."}
{"Author": "Altyreek Swails", "Date": "March 5, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Works when it wants to. Would be nice for wink, echo and google home integration"}
{"Author": "john edwards", "Date": "March 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So far this is great. Was an easy installation and works really well, we'll see how it goes in the long-term."}
{"Author": "hillary fraser", "Date": "May 21, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "It still has issues with the Bluetooth losing signal at times, but overall a great app."}
{"Author": "Brian Groll", "Date": "March 7, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Asks for sign in every time app opens. Cannot use Bluetooth remote as I'm not logged in."}
{"Author": "Greg Lemon", "Date": "April 24, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "$200.00 Paperweight ! Takes WAY TOO LONG to locate and open the lock. Do yourself a BIG favour and Use a Key !!"}
{"Author": "Gary C", "Date": "February 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works on the lock most of the time. Sometimes it needs me to start up the app for the locking to work. Integrates very well with Nest."}
{"Author": "Daryl Hall", "Date": "February 27, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Good so far. Few days in but no problems yet. I will say easy to set up and install."}
{"Author": "Laurin Dunn", "Date": "March 4, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Does what it is supposed to do from time to time have Bluetooth issues, but works great for me."}
{"Author": "Tim Seward", "Date": "March 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works fine on my Samsung note 5 and fairly easy to use.. however it's hard to find the calibration settings.."}
{"Author": "Nick Nock", "Date": "March 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "New update absolutely killed my battery. Go back or fix it please"}
{"Author": "Ridge Bandeen", "Date": "May 8, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Leaving the bluetooth on on my particular phone drains the battery, but used wisely it's a great app."}
{"Author": "Tamika Haynes", "Date": "April 24, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So far so good.  Been using it for a week on both a Pixel and Galaxy S8 and it's working flawlessly."}
{"Author": "Linda Thomas", "Date": "February 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Easy to follow instructions and love not having to take my phone out yo unlock the door."}
{"Author": "Jesse Kaine", "Date": "May 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't get pixel XL to pair at all, always says try again."}
{"Author": "alex mayer", "Date": "April 30, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Now that the update allows me to use my Google pixel XL I love this app again"}
{"Author": "Ricky Perez", "Date": "May 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Needs a widget, takes to long to into the app."}
{"Author": "maggi saude", "Date": "April 16, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Convenient hassle free when you arrive home with arms full and no free fingers to unlock a door 😉"}
{"Author": "Michael Davies", "Date": "March 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It took it a while to get calibrated but now it works like a charm! Awesome."}
{"Author": "mike m", "Date": "May 19, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "nk google assistant support!? really?!"}
{"Author": "Rusty Vorce", "Date": "May 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Good second generation effort as I owned the first. Room for improvement is possible in my view."}
{"Author": "Sarah Brazier", "Date": "March 31, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "No longer have to search for my keys!"}
{"Author": "Jamey Scally", "Date": "May 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Absolutely love it! Great when I'm working in the yard to access tools etc in basement"}
{"Author": "Panagi", "Date": "April 28, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "When it works it's amazing, but has lots of bugs"}
{"Author": "Sunmi Park", "Date": "April 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "This is making my life so easy.  I love it.  You will too :-)"}
{"Author": "Byron Cotton", "Date": "May 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It is very convenient no keys to get out when your hands are full"}
{"Author": "John Frangella", "Date": "June 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "No more keys!!!!"}
{"Author": "James Fournier", "Date": "March 11, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "So slow!"}
{"Author": "ADAM FLEMING", "Date": "May 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works like it should."}
{"Author": "Jason Wright", "Date": "March 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo is trash."}
{"Author": "Michael Barnes", "Date": "April 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I have had it for about a year-and have change the batteries only once"}
{"Author": "Jeff Adkins", "Date": "May 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as advertised!!"}
{"Author": "Abdus Azad", "Date": "February 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great with LG v20 now app is very smooth"}
{"Author": "Chris daCosta", "Date": "April 30, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Upgraded and love the new features. Easy to use and well executed."}
{"Author": "Luis R.", "Date": "May 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "No J7 support ?????????? How do you have such a modern lock if you can't even support modern phones?"}
{"Author": "Fernando Bogle", "Date": "May 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "No complaints,  very user friendly and I like it."}
{"Author": "John Grimble", "Date": "April 25, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great!!! Kevo batteries lasts 6 to 8 month"}
{"Author": "Jeffrey Frey", "Date": "May 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works perfectly, and keeps life hassle free."}
{"Author": "Dave Levy", "Date": "March 17, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works 90% of the time. No real complaints"}
{"Author": "thomas beaver", "Date": "March 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great I love it, works awesome, no problems"}
{"Author": "Dan Durocher", "Date": "March 20, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works good the lock it self is very sensitive"}
{"Author": "Ryan Evans", "Date": "March 21, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works well. Never had any issues."}
{"Author": "Chuck Rodgers", "Date": "March 13, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works great when I touch the lock"}
{"Author": "Joseph Martinez", "Date": "March 17, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It works"}
{"Author": "Carl Wiehe. Sr", "Date": "February 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's all good and works"}
{"Author": "Sean McBride", "Date": "April 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great app and easy to use."}
{"Author": "Jesus flores", "Date": "March 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Work the way it's supposed to. 👍"}
{"Author": "Thomas Fifield", "Date": "May 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Amazing system!"}
{"Author": "Danny Wallace", "Date": "May 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I is easy to use"}
{"Author": "Oscar Aguilera", "Date": "March 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it!"}
{"Author": "Scott Olson", "Date": "May 7, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Sall good"}
{"Author": "Charles Lake", "Date": "April 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome product"}
{"Author": "doug rawe", "Date": "March 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great for families"}
{"Author": "Alesia Washington", "Date": "April 15, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great product"}
{"Author": "", "Date": "April 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "F'n great"}
{"Author": "Allan Phillips", "Date": "March 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Great"}
{"Author": "", "Date": "May 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome"}
{"Author": "", "Date": "May 4, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it"}
{"Author": "Larry Higgins", "Date": "April 23, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love it"}
{"Author": "Roger Florencio", "Date": "April 21, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awsome"}
{"Author": "Adam Erickson", "Date": "May 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Awesome"}
{"Author": "Mark Mitchell", "Date": "February 16, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "As other reviewers have stated, this is a really disappointing product thus far. Latest update killed my eKey on Android. It was working... not anymore. I now have no way to unlock the door without a physical key which obviously defeats the purpose of my $150 Kevo Convert purchase. My dog walker now can't access my apartment. Tried uninstalling and reinstalling the app - doesn't make a difference."}
{"Author": "Ayrton Markowski", "Date": "February 14, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Okay so far. Somewhat difficult to setup. The menus are fine, just seems a little unstable.  Email verification works even though it sends error messages.   We'll see how it goes."}
{"Author": "Katherine Nagler", "Date": "February 13, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Good concept. rarely works, support needs to be available 24/7. Locked out of my place right now and have been for some time this evening."}
{"Author": "Anthony Zerafa", "Date": "February 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Since the update the Kevo app and lock have been rock solid. It took some time but they seem to have figured it out"}
{"Author": "Jody D", "Date": "February 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work . 4 hrs between lock in+out/return/tech support. Final answer, 'can't help you'. Don't buy this device. Customer svc doesn't exist. 1/2 hr on hold - twice."}
{"Author": "Brandon Lilly", "Date": "February 14, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Could never get the app to work. Would not realize location services was enabled, so I could not pair a lock."}
{"Author": "Michael Strickler", "Date": "February 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Loving it Took a couple times to set up the locks but they are working for both my wife's iPhone and my android. Locks took a couple tries for each phone but working great now"}
{"Author": "James Bunch Jr", "Date": "February 11, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "The Moto Z Play is now an authorized device, as of the latest update, making Kevo a solid option in the world of Android..."}
{"Author": "John Strock", "Date": "February 15, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Much better now that ekeys are free!  Lastly would love to have wifi built in."}
{"Author": "Pascal Radano", "Date": "February 20, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works like a charm, set up eKeys for other family members, updated the locks software; all very easy to use."}
{"Author": "Theo Weiss", "Date": "February 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "After update like so many others I cannot see or edit active ekeys."}
{"Author": "Shawn McManus", "Date": "February 17, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "It takes too long to unlock. It would just be faster with my key."}
{"Author": "Roy Greensmith", "Date": "February 12, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Only installed this app because I need it to access my father's house. Would never use it otherwise; makes me sign up an account for what should just be authorising my device with the lock; has no option to turn off the background running for something I might use twice a week; automatically signs you up for all their stupid mailing lists without telling you; android is clearly an afterthought, barely even basic functionality and customisation options"}
{"Author": "Mr.mannmann123 Pumpalov", "Date": "February 17, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I can go really far"}
{"Author": "Phil Davies", "Date": "February 20, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works every time.."}
{"Author": "Peter Rexer", "Date": "February 26, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Now that guest key's are free, it's great"}
{"Author": "Mandee Myers", "Date": "March 18, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I absolutely love my kevo"}
{"Author": "Debby Sutton", "Date": "February 15, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Love my Kevo!"}
{"Author": "Taylor Pacey", "Date": "February 14, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Straight up awesome!"}
{"Author": "Lamarian Jolley", "Date": "February 12, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "HITECH"}
{"Author": "Eric Homtad", "Date": "February 19, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works awesome with kids"}
{"Author": "Brendan Brown", "Date": "February 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Just updated the app now my locks don't work at all, How do I roll back to the first version???  Installed 2 new Kevo (gen 2) locks to replace an old biometric lock that was on the fritz. The locks themselves were a joy to install and have worked seamlessly since, am more than happy with them, the only reason I haven't given 5 stars is because my Kevo plus hasn't worked since receiving it am currently working through it with the support team who have been very pleasant thus far. Fingers crossed the issue will get sorted and I will give the extra star"}
{"Author": "eddie steele", "Date": "February 7, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "This app worked perfectly on my HTC 10 until version 2.0 was released. Now it keeps logging me out and telling me its an incompatible device. I under stand that you're techs probably havent fully tested the HTC 10 but I assure it works as needed.  Please add the HTC 10 to the device checks to eliminate these issue. Downgraded to older version for now."}
{"Author": "Stu S", "Date": "February 7, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Nexus 5 + software update seems to have it working OK now. Still gotta awkwardly lift my hip up. Designed for purses, not pockets. Before: the range makes it almost useless (has to be about a millimeter or so away from the lock). But the almost worst part is the run-in-background stopped working. The worst part is that it stopped working in the background with the last iPhone upgrade, and they were all over it, fixed quickly. In this household, Android bought the lock, so neglecting it is not good."}
{"Author": "Alex Parker", "Date": "February 9, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Finally has Pixel support! It says it unlocks faster, not true in our office, but maybe for others? The tap to lock/unlock usually doesn't work on the first 2 tries.  -2 stars for slow/failing access. -1 for Administration issues."}
{"Author": "Sean Mitchell", "Date": "February 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I've had this look for about 2 years. It's had many support issues with Android phones in that time. The new update to 2.0 seems to have finally resolved it. That said I'm not yet convinced it will work one my next one because I've been let down so many times. For now 5 stars but I'll drop it to 1 again if support is dropped next time I switch phones."}
{"Author": "Jerry Ovesen", "Date": "February 1, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I received an email 2 days ago that today a new version of the app would be released and that suggested it would fix most of my issues, as it allows \"Non-supported phones\" to install the app.  The app is in fact now installable on my LG G5 and I will check functionality this evening and further update this review."}
{"Author": "Mark Studer", "Date": "February 1, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Much better now that I don't have to side load.  My biggest complaint is that you can't see the history for all entries and exits (manual key and fob) and you can't control the day / time access for a fob.  I can't give a service an e-key as it changes people, but I can give out a fob.  However you loose all capabilities with the fob and have to reset the device to remove it if lost."}
{"Author": "Richard Georges", "Date": "February 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Do not buy a Kevo. I repeat, do not buy one of these. They work intermittently, if at all. It takes longer to get it to recognize your touch than to get out the key. Then,when I got a new phone, the Lenovo Phab2 Pro, which is running Android 6.0.1, the app says it is not compatible. What? Keep your money.  Postscript: Well, go figure. A company that listens to its customers. I have now been able to install the app on my new phone. It says it is unsupported, but is working now. I am having some difficulties updating the lock software; but, it is looking good. Thanks Kwikset. You have me back as a customer. Four stars."}
{"Author": "Vincent Labrèche", "Date": "February 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Invasive and unhelpful. Remove the stupid notification or make it optional at least. I already know I have Kevo, u don't need it in my drop down menu."}
{"Author": "Frank Harlan", "Date": "February 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I've had my Kevo lock for over a year and it has never worked correctly. This is one of the worst purchases I have EVER made. I have to hold my phone within about 1\" of the lock for it to work and I have ro tap on rhe lock 3-4 times before it finally works.  Sometimes i give up and use my key.  I'll open the door and the Kevo will finally operate, but after I have already unlocked it manually and opened the door. So the deadbolt will be in the locked or \"out\" position when I am trying to close the door. I'll manually unlock it close the door and lock it .....the the Kevo will unlock the door when I want it locked."}
{"Author": "Dlo Brown", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Finally full Android support. It was pretty sad I had to side load this app to make it work as it was fully compatible with the lock and my \"non compatible\" LG V20. Now it has official support. Great job, just please don't break it!!!!"}
{"Author": "Samson Lau", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So glad Kevo is finally available on Android.  The app functions as intended on my Nexus 6.  Locking/unlocking works every time, no issue so far.  One feature you may consider adding to the app before it comes out of beta is to detect whether bluetooth is turned on when the app is first being set up (and to remind the user to turn on the bluetooth if it is off).  It will smooth out any issues with users who may not realize that their bt is turned off and wonder why their phone isn't communicating with the lock.  Update:  App is now also compatible with Google Pixel."}
{"Author": "Jonathon Montgomery", "Date": "February 2, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "The website shows an ability to update the lock yet it looks noting like what was pictured on the website. I am giving this such a low rating because we have so many problems with this lock. Random locks and unlocks, even when I am several feet away. With the new app it is also dodgy, dosent want to lock when touching the lock but it will unlock. It seems fine but slow when locking and unlocking from the app."}
{"Author": "robert ducharme", "Date": "February 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Recent update broke functionality for my device (s7 Active). I can no longer unlock my deadbolt, only issue out keys. Please Fix!"}
{"Author": "douglas linn", "Date": "February 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Generation one WAS lacking a lot.  With the new upgrade, it works as I had thought it should from the beginning.   Very easy, very smooth"}
{"Author": "Joe Watkins", "Date": "February 5, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Would like to see more phones supported rather than just a few of the top models. I had to side load the app from a file share site cause my Moto X pure still isn't supported the app works fine but phone still won't pair directly to lock as owner but still control locks as long as my phone is on my side.  The unlimited ekeys is a nice bonus that kinda should've been free all along but still nice to have now,  next I need the plus add on"}
{"Author": "Datz Echo", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Finally. FINALLY. KEVO GOT IT RIGHT!!!!!  Lg V20 works Lg G5 works Lg Stylo 2 Works.  Samsung lower end galaxy WORKS!!! Thank you kevo!!!!  Now my$200 lock is worth every single penny!!!!"}
{"Author": "Philthy Kennedy", "Date": "February 3, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Several emails to and from customer service to get it to work without any luck.Credit to customer service for speedy responses and an honest effort.Shame shame shame on Vodafone who it seems purchased the cheaper Samsung S5 model with the different chip in it which is why it wont work.So frustrated and disappointed after purchasing 2 new S5s for the wife and I as we still cant use our phones to open the lock. 3/2 Update. Email received.Samsung s5 now working and its been worth the wait.Very impressed far and pleased that ekeys are now free.Well done for listening and continuing support."}
{"Author": "Shane Monroe", "Date": "February 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Broken.  Last version was great.  This one is totally broken.  Do NOT upgrade to this version.  I'm warning you with peace and love ..."}
{"Author": "William Smalley", "Date": "February 6, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I have to sign in every time my phone is restarted, wouldn't be so bad if there was fingerprint"}
{"Author": "Shannon Woods", "Date": "February 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Very happy with the latest version of the app! Thank you for expanding device support and allowing unsupported devices to still administer keys."}
{"Author": "Kirby Safinuk", "Date": "February 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I installed the v2.0 Kevo app on my LG G4 device. First time running the app it informed me certain capabilities would not function. The app on my mobile states it is software version 1.4.13, should it not state v2.0?"}
{"Author": "Kirby Safinuk", "Date": "February 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "I installed the v2.0 Kevo app on my LG G4 device. First time running the app it informed me certain capabilities would not function. The app on my mobile states it is software version 1.4.13, should it not state v2.0?"}
{"Author": "Alberto Leyva", "Date": "February 5, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "I love my Kevo and I'm glad that you guys are working on updates for it. I do wish there was a way to keep connected to the lock when I open the app, but the speed has improved marginally. Excited for future updates."}
{"Author": "Chris Emery", "Date": "February 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "New version now works with my LG G4 again. Not happy about the three months it was locked out but I'll up my review now that it's working"}
{"Author": "Aaron Holmes", "Date": "February 7, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Great app. Now android has lock and unlock from phone without touching device. Awsome guys. Keep up the good work"}
{"Author": "George Capalbo", "Date": "February 4, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Well, this is a huge improvement. Supports Hwawei Mate 9, my first gen lock actually works now. Appreciate the free keys. Android wear now working as well (could be faster though to 'find' the lock)"}
{"Author": "Robert Brown", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "App was fixed to allow free anytime keys! Thanks for fixing the apps biggest issues!"}
{"Author": "Eric Polin", "Date": "February 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "After waiting for a proper version for years, with devices that met the BT requirements, I can finally say that my pixel XL works great with the app."}
{"Author": "Algenard Simmons", "Date": "February 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This update is horrible. It searches for the lock for about 20 seconds THEN, if it even connects, it only connects on the inside. Apparently with this new update my door also became too think to get a signal, leaving me unable to open it from the outside. Horrible update, how do I roll it back?"}
{"Author": "", "Date": "February 7, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "The new update fixed the connection between the Kevo and my Sony Z5Compact again (Android 7.0)"}
{"Author": "William Hahn", "Date": "February 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "For real? Get this working on the latest version of Android please.  It's been out for months."}
{"Author": "Derek Strainer", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Pixel support is now fixed!!!!!!!!!!! Thank you so much"}
{"Author": "Douglas B. McKay", "Date": "February 2, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Email notifications still showing time 1 hour off. App version still shows v1.4.13 even after un/re-install."}
{"Author": "Daniel Morgan", "Date": "February 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "App and first generation lock are working great now after updating software for both. Unlimited free ekeys is a nice touch."}
{"Author": "Home Lim", "Date": "February 1, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Installed on Pixel. Very slow update."}
{"Author": "David Zhao", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Pixel support fixed! Thanks!"}
{"Author": "BigBrad75", "Date": "February 1, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Better than it was, also added several new compatible devices , bout time! Thank you KEVO"}
{"Author": "Mi S", "Date": "February 11, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "4 star only cuz I wish the app had a option to auto door lock."}
{"Author": "Dominic Dot Okune", "Date": "February 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Few little bugs but other than that works fine"}
{"Author": "Ethan Brown", "Date": "February 2, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "New update doesn't let me remove push notifications."}
{"Author": "Hosea Brawley", "Date": "February 2, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It finally works for my lgv20. It gets all the stars now!!!"}
{"Author": "Eric Hahn", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Does what it says.  It has worked reliably.  What else can you ask for from a lock"}
{"Author": "Brian Carrasco", "Date": "February 6, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Downloaded the update now it will not lock/unlock"}
{"Author": "Beau Mersereau", "Date": "February 6, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Finally works with more Android devices. Woot!"}
{"Author": "Bill Williamson", "Date": "February 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Now that we are out of beta, working well"}
{"Author": "Pat Collins", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works well on Nexus 5X android version 7.1.1"}
{"Author": "CUBANOCTOPUS", "Date": "February 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "It finally works for my V20!!!"}
{"Author": "", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Much better than the last version.  Please keep the regular updates coming."}
{"Author": "", "Date": "February 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Small access control unit for a simple small environment/ that's a DIY."}
{"Author": "", "Date": "February 7, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "I want it to connect with my Wink Hub, otherwise it is great."}
{"Author": "Bryan Lutz", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "With the latest update this device now completely supports the Pixel phone"}
{"Author": "terry moseley", "Date": "February 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "So far new version works great!"}
{"Author": "Bill Schuurman", "Date": "February 8, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Does exactly what it's supposed too!"}
{"Author": "Pablo Leal", "Date": "February 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It is a great app for home security"}
{"Author": "Jesse Ramirez", "Date": "February 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works great for my entire home"}
{"Author": "Miriam Andrei", "Date": "February 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Too slow"}
{"Author": "Kevin", "Date": "February 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's.AWESOME"}
{"Author": "pitishor1", "Date": "October 9, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ney on a lock and keep spending</span> App is ok, but it keeps insisting in getting me to spend more money on the \"plus\" version. I can put up with with the banter for the plus version for which I have no use, but I find it disgusting that you have to pay for extra E-keys. Perfect example of how companies find a way in your pocket and they keep wanting more and more. There is absolutely no measurable cost for creating the ekey but you still have to pay for it. Going back to simple locks but will make it a point not to buy from the same company."}
{"Author": "Mauricio Santiago", "Date": "January 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "(To help others... install kevo apk on Pixel phone)   So it's an awesome concept. Works perfect for small family or single person... for a large family it becomes expensive. In concept it's easy to send someone an ekey to enter home, but you soon find out the cost quickly adds up. App lacks support and deadbolt somehow drops connection to app... for everyone with a phone like the pixel install kevo app via apk."}
{"Author": "arthur jay", "Date": "November 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Just bought and installed two Kevo locks. It worked fine but then I bought a new phone, Google Pixel. I went to install this app on my new phone to find out I can't download it because it says my phone is not supported by this app. So I can't use my phone to unlock my doors which is why i bought this lock. Therefore this lock will limit your phone choices and if you buy a new phone it probably will not work with this lock. They are slow to add new phones like the Google Pixel, which is still not supported even though it is running a supported Android version."}
{"Author": "Luis Lopez", "Date": "October 7, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "nd calibration settings for 2nd generation</span> Installation was easy but I can't find the calibrate setting in the app on my android galaxy s7. I have not been able to get it to work. I called customer support and was on hold for over an hour. No one ever came back. If I don't get help soon I'm going to return the lock."}
{"Author": "Derek Heaton", "Date": "December 12, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "So, now that you made this app work with the Note7, can you set it up to work on my non-exploding replacement Pixel XL?  Not sure why this app only works for a few phones. It really makes the lock useless when you change phones.  Why not just release it for all phones?"}
{"Author": "Ted Windsor", "Date": "October 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "tent</span> Was working fine but now doesn't work at all on my s5.  Can't even see the lock.  I reset it and want able to set it back up.  I used my wife's iPhone and it worked flawless, made her the owner, sent myself a key.  No dice. I should have bought an August.  At least that works without my Logitech Harmony."}
{"Author": "Colin Nisbet", "Date": "October 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "battery drain on Note 7</span> Had Kevo lock for a few years and i like it. I still need to keep a lockbox around for when it doesnt work though. Currently my #1 battery drain on my Note 7. #2 is not even vlose.  I have to disable the app every day and reopen it when I want to open my door.  Needs to be updated ASAP"}
{"Author": "Dustin Capps", "Date": "January 16, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": " open inconsistent</span> For months, my lock worked just fine. Now the touch to open feature will only work if I go through the hassle of pulling out my phone and opening the app. I have a Note 5 and have the app set to run in the background."}
{"Author": "Leonard Tan", "Date": "October 14, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "but android wear function doesn't work</span> As far as unlocking and locking, it works fine for me. I thought the Android wear function was cool, but it doesn't work. When I try turning the function on, it loads and then an error message pops up. I hope they fix this soon!"}
{"Author": "Carolynn Slaughter", "Date": "September 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "support all android phones</span> Sadly we bought and installed this and it doesn't work with a lot of Droid phones. My husband has a new LG V10 and it won't work with the kevo. My daughter also installed one and discovered her father in laws new phone with android also won't work.  It looks like the kevo mainly supports Samsung Galaxy."}
{"Author": "morgan wright", "Date": "October 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " money</span> 1. The key supplied didn't work so I have no override capabilities 2. It works when it wants to 3. It randomly locks and unlocks 4. has now stopped working completely even though the lights flash green"}
{"Author": "Mark Baker", "Date": "October 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "an> You know there's a problem when there's nearly twice as many 1 ⭐ ratings as there are 5⭐ ratings. I used to love my Kevo, but now I'm just pissed off. One of the updates in the past month or two is causing my app to either say \"contents hidden\" (whatever the hell that means) or, \"Kevo is sleeping, move your device to wake\" I can shake my phone like a madman and it won't wake. I have to open the app up for it to work. What's the point.... Why don't I just take a key out of my pocket (that works EVERY time,)"}
{"Author": "Mike Bryson", "Date": "September 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "s to be something better</span> The kevo plus function rarely works. Error message saying unable to connect to your lock at this time. It wants the phone within distance to the lock. Waste of money!"}
{"Author": "Steve", "Date": "September 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "essed</span> For the price, it should work flawlessly. It doesn't, someone mentioned used error... BS! I've read the instructions 3 times before installing. The Bluetooth fuction sucks, end of story."}
{"Author": "Cory M", "Date": "October 11, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "y good.</span> The app does what it needs to do and I find the lock itself quiet good. E-keyes costing additional money is fairly ridiculous. I get it, actual keys cost about 2$ per key. But we aren't using real keys, so that's an incredibly thin justification. You wouldn't charge to send an email just because it cost money to send a letter. My other gripe is Kevo's assumption that I want them in my notification bar 24/7. Thankfully you can hide the notifications from specific apps in Android"}
{"Author": "Jeffers 519", "Date": "September 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ut yet again</span> This piece of $h*t is going in the garbage where it belongs. Phone keeps randomly deciding to not pair with my lock, leaving me locked out of my house for the third time now. Works fine when I leave my house, but when I come home, oh, surprise, \"kevo can't connect at this time\" again. Yes, my Bluetooth is on. Yes, my location services is on. Good thing I now keep an emergency key nearby for these occasions, defeating the purpose of having this lock in the first place."}
{"Author": "Matty Woodruff", "Date": "December 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "No Google Pixel support so lock is pretty much useless. Key fobs also continually stop working and I have to reset the entire lock to get them to work for just a few more weeks."}
{"Author": "Shane", "Date": "September 27, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "in for note 7</span> For as disappointing as it was switching from Apple to the note 7  then not being able to use my lock, kevo took care of me and sent me two FOBS. So thank you for being amazing. I'm happy to finally have the app back."}
{"Author": "David H.", "Date": "January 20, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "if you can find a phone that is actually compatible with it.. great, but don't expect it to not be a samsung device. pretty disappointed that I have to resort to my work phone to open my doors (or sideloading a version of the app with the manifest updated to allow it to install on my phone of some shady back alley web site) I'd be completely irate if I didn't have the backup.  And don't even get me started on the android wear \"addition\", every time i looked at my watch, I had to swipe away a crash report from kevo to check the time."}
{"Author": "steve diani", "Date": "November 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ce of crap</span> bought for convenience yet biggest technology headache I've purchased for my home. seldom works w my nexus 5x and can't update the lock software w my 5x either."}
{"Author": "Amir Bektic", "Date": "October 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "pend???</span> This app went from perfect to crap. Why is it logging me out every time my wife logs into her app and vice versa???? It defeats the purpose of a stress-free entry. I would rather fumble for my keys then pull out my phone and sign in every time I have to unlock my door horrible horrible app ,what happened???"}
{"Author": "Ron Jackson", "Date": "December 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "hone support?</span> My son was about to buy this for me as Christmas gift.  I am getting a Google pixel phone.  Not supported?  I'd hate to buy a new phone in a few years and find I'm locked out again.  Confused why there is so much issue supporting most all Android phones so long as they are only a few years old on software or on latest software.  Sad.  Glad I saw these reviews before spending couple hundred bucks on a manual key lock which I already have."}
{"Author": "J. Davis", "Date": "December 6, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Drain</span> Love the product but the app is burning through 50%+ of my battery everyday. There is no need for this app to run in the background that much. I have to disable the app then turn it back on every day going home."}
{"Author": "Nick Sparandeo", "Date": "December 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "rt for PIXEL!</span> Even though it's supposed to support Android 7.1, it won't let you download the application to a pixel! So I have a very expensive lock and a very expensive phone, which are supposed to work together but do not. I even had to log this rating on my old device!"}
{"Author": "Tony MacDonald", "Date": "November 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "eports Kevo is sleeping...</span> If I have my phone with me , I'm supposed to be able to just walk up to the door touch it and it will unlock. But most of the time I have to pull the phone out of my pocket Slide the status bar down hit the button because it says it's sleeping and then I will then it'll work. That is not how it's supposed to be."}
{"Author": "Alfonso Meneses", "Date": "November 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "aste your time and money</span> I bought this one today,  and came to the surprise that none of my family,  except myself have supported devices (poor device support), then the electronic keys FOBs do not register logs, plus you get charged for extra ekeys!!  I'm not paying 200 dlls for this thing...I'm returning this tomorrow"}
{"Author": "Evan Kroft", "Date": "November 22, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Lack of compatibility for Pixel highlights a bigger problem in their approach to product management and ability to proactively support their product. Your target audience IS early technology adopters, time to get your ship in order or risk losing this project entirely."}
{"Author": "Shyne Kim", "Date": "September 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Please make the note 5 compatible . I've been waiting for a very long time. I would like to use my phone to lock and unlock as I do not like to carry keys or the fob that it comes with. The reason I bought this was to use my phone. So please make note 5 compatible.  Thanks."}
{"Author": "Mike Tams", "Date": "December 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "I have a Samsung s7 edge plus. I love the concept of this lock, but the execution is horrible. I bought the lock because I was led to believe that all I would have to do was have my phone in my pocket and I could unlock my door with the touch of a a finger. I reality I touch the lock, the blue ring flashes, then I have to take my phone out of my pocket notice that the app is sleeping, then open the app because it tells me to move my phone to awaken it but it won't, once I open the app, it will connect to the lock and then I can open it with the touch of my finger. I wish that they would have told me that this was the way that they had programmed it and I would have saved myself $180 buck and not bought this. The great part is that I have tried to call their support line but they are closed due to a system outage."}
{"Author": "Jeffrey Bowker", "Date": "December 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "s</span> The box and advertising says you need a phone with Android 5.0 or higher. Out of 4 phones with 5.0 or higher, ONE works. The others are \"incompatible \". Basically Kwikset decided only certain phones will work, regardless of the Android version."}
{"Author": "Brian Sweatt", "Date": "November 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Get your device compatibility list together, Kevo. New devices that have the necessary hardware and OS support should be compatible. Period. If you need help with this, let me know, and I'll gladly teach your Android devs how to avoid this."}
{"Author": "Scott Lewis", "Date": "December 2, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "App worked correctly for a while.  Got plus.  Even with plus it required me to be within bluetooth distance of the lock.  Plus should have eliminated that.  Can use the web site no problem.  Phone app just don't work."}
{"Author": "David Roupe", "Date": "December 20, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Why do I always see messages from Unikey saying that they are working on expanding the Android platform but I can sideload the kevo.apk file onto phones like the new Pixel or even my son's older LG Leon and the app works perfectly (well, as perfectly as my Nexus 6P that shows compatible)  KWIKSET (Unikey), get your act together, your app works on many more phones than you even know, you need to truely support the android platform not just Apple, there is plenty of competition out there that is just as good or better not to mention cheaper!!"}
{"Author": "Irvin Fitzgerald", "Date": "October 22, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "tency w/ lock (not the app)</span> Kevo 1st Gen w/ Samsung Galaxy S7. Significant battery drain on the lock itself. I've change 3 sets of batteries in two months. This is really strange because the original set of batteries used on lock installation lasted almost a year. Now the lock is sucking the energy out of my energizers. The lock is also slow to recognize when it's been touched (tempermental). I now have to wait about 30 seconds before touching to lockup. Not to mention the incredibly slow response of Kevo Plus!"}
{"Author": "D", "Date": "November 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " design. Barely works.</span> I use the key because it's so slow, ineffective, unreliable. I'll never buy another one again. Worst lock in the history of electronic locks."}
{"Author": "Rafael Turcios", "Date": "October 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "able</span> Logs out sometimes. Diesnt recognize I am in range, the door will lock when you accidentally touch the handle"}
{"Author": "Aaron Pierson", "Date": "November 4, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "ntrol much</span> Can't turn off auto lock, takes forever to reach the lock with kevo plus to unlock, can't verify software updates. For the price, probably one of the worst apps in its class."}
{"Author": "Paul Watkins", "Date": "November 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Not compatible with Pixel or Android 7 which on a product like this is soon to be a large portion of their users.  Back to a conventional lock.  FAIL!"}
{"Author": "Dan Low", "Date": "December 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Shows as not compatible with Google's flagship Pixel.  Sideloaded the app anyways and it works without any problems.  Please get your act together."}
{"Author": "Mike Pentony", "Date": "December 16, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "For anyone with a Pixel or Pixel XL the Kevo app should work on your phone.  Works on my Pixel.  You just need to copy the app from your old phone (if you still have it) to your new and install it.  There are apps in the store that let you 'extract' the Kevo installer from your old phone."}
{"Author": "Blake Boyd", "Date": "November 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked great with my Nexus 6 but I just upgraded to a Pixel and now it says my phone isn't compatible. Needs to be updated to support the Pixel and Pixel XL."}
{"Author": "Joe Villanueva", "Date": "December 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "le and tedious</span> Unnecessarily updates literally every single time you open the app, connection is only 50% of the time. It's like you're gambling every single time you walk up to the door, heaven forbid you're carrying some groceries or your farther away than 5 feet. It's embarrassingly unreliable."}
{"Author": "Hard Knox Stunts Inc", "Date": "January 28, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This lock and app both drive me crazy. I would never buy these again.  Settting them up is not hard but an act of patience. Then half the time it doesn't even work."}
{"Author": "J Jones", "Date": "January 1, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "ork</span> Was working fine a couple of updates ago and now I have to pull my S5 out of my pocket and touch my phone to the lock to open it and that's after a couple trys before it works also in the notifications it now says \"kevo not ready tap here to enable bluetooth\"...bluetooth is always on on my phone....sucks when both hands are full and have to drop everything to open a wireless/touch lock....IT WORKED FINE BEFORE!"}
{"Author": "Alvin Watson", "Date": "November 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "ck poor app</span> The lock is great for I have two on my place ....price a bit ridiculous but my be worth it if the app worked the way it's pose to work ...if I don't use my phone it works with the fob everytime..well up until recent it says that my fob need to be reprogrammed but I hit the program button still nothing changed the battery in the fob still nothing I paid $$$200 × 2 and neither of the fobs won't ....great lock though I like that you can use existing  key with the rekeying tool I just want 2 fobs that works"}
{"Author": "", "Date": "December 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Deeply disappointed.  Wish I had read these reviews before I purchased.  $400 down the drain and my wife is pissed at me cuz their product sucks."}
{"Author": "Chris Johnson", "Date": "October 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Love Kevo but, has major update issues.  7.1 naught is incompatible and ios 10.02 was incompatible for a chunk of time as well."}
{"Author": "Sam Shores", "Date": "January 5, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "After spending a lot of money on this lock and the plus gateway, I've found that I am severely limited to which phones I am able to use because their app does not have broad android support."}
{"Author": "Norm Voshall", "Date": "November 11, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "n't have Calibration</span> Directions tell you it is important to calibrate each device after pairing, but their is no calibration setting in the app."}
{"Author": "Michael MacFynn", "Date": "September 27, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "igned out</span> It takes me longer to sign in everytime then to pull out a key.. everytime i go to use it.. im signed  out and have to sign in again"}
{"Author": "Ignacio Gutierrez", "Date": "October 29, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "o Turbo 2</span> Come on guys! ! What in the world! I need this to work on new Turbo 2. Please fix fast!"}
{"Author": "Michael Magallanez", "Date": "November 20, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "lf the time</span> galaxy s6 and it works in morning bit when i come home i have to unlock phone and open app to work lock might as well just use key want trying to get money back"}
{"Author": "Lucas Rodgers", "Date": "December 17, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Convenient, but recently it has been a huge battery drain even after several restarts of the phone.  Otherwise an awesome investment."}
{"Author": "Brenda Cook", "Date": "September 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "eat</span> I would have enjoyed just using the key fob but it had stopped soon after installments."}
{"Author": "Robert Nguyen", "Date": "October 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "d to setup</span> I can't make the Kevo Plus working. Wasted money and time"}
{"Author": "Jesse Dena", "Date": "December 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Gimmick! Worst lock ever. Does not open door even with app open. Takes at least 5 tries."}
{"Author": "James Stultz", "Date": "October 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked on my Nexus 6p now I have the new Pixel XL no go my lock is now useless."}
{"Author": "Eddie Daniels", "Date": "November 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "upport but no pixel?</span> Update adds support for a discontinued, recalled device, but no support for the Google pixel? Seriously? There's not even a beta option!"}
{"Author": "James Goff", "Date": "October 20, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "rfectly !</span> I have a galaxy note 5 and the app and lock work seamlessly, had a digital keypad lock before, this is so much better! I definitely recommend the app and lock. Take into consideration your device may not work as well as mine."}
{"Author": "Peter Paulo Dangoy", "Date": "September 18, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " it works!</span> Finally happy that the Note 7 is now supported. However, the same Note 7 says the Kevo app is a battery hog. Please fix this. Thank you."}
{"Author": "Linda Slomowitz", "Date": "December 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "n't work</span> Just got this lock; can't sync the app on my S7, but my son had no problem with it on his iPhone...what gives?"}
{"Author": "Anthony C", "Date": "December 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "j5 no longer compatible</span> I have used this app on a Samsung Galaxy j5 for a while now. I have Uninstaller the app and want to reinstall it and it is now not compatible?"}
{"Author": "Gregory SD", "Date": "November 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ce kevo update, the lock sucks</span> Spoke with customer service they sent me a refurbished replacement lock that worked for one day and then the next day it keeps saying connecting..... non stop then says that location services  needs to be on. Turned it on then says won't connect. Try to delete ekey , now it won't pair with phone. I try to reset phone and app with no luck. Frustrating experience."}
{"Author": "Dan Zhang", "Date": "September 23, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Kevo force closes on Android Wear watch over and over again.  Tried several different watches and Android phones and error remains."}
{"Author": "Brenda R", "Date": "October 1, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "ly does not connect</span> Too often I have to touch the lock multiple times or use the key to unlock the door.  The key fob has to be calibrated to the kevo constantly.  When it does work,  it's great."}
{"Author": "Brian Switzer", "Date": "February 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "This only works about 20% of the time. I purchased the plus and that didn't even connect. Can I get a response back please?"}
{"Author": "T Z", "Date": "October 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "librate</span> We both have samsung 7s and can't calibrate them with the lock. The app doesn't allow it. 14 day return policy. If it isn't fixed I'll take it back."}
{"Author": "Chris Janczy", "Date": "December 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Why is it taking so long to support Pixel XL??? This is ridiculous"}
{"Author": "Mike Tomlinson", "Date": "September 25, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " the calibration???</span> Can lock and unlock with the phone in my house. Why is there no manual calibration?? Works great on iPhone but android app sucks ballz"}
{"Author": "Emil Wisekal", "Date": "December 15, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "I have a Nexus 5x phone on Nougat 7.0, and this app works fine.  I may be singing a different tune after my phone updates to Nougat 7.1, I guess we'll find out soon."}
{"Author": "Christopher Wilson", "Date": "January 27, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Used it for Airbnb, completely inconsistent with respect to opening doors"}
{"Author": "Kolapo DaSilva", "Date": "October 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ible with Google Pixel</span> Works fine on Nexus 6P"}
{"Author": "Mike Rodriguez", "Date": "September 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "working with Nexus 6p</span> It's been working great as of late Nexus 6 p"}
{"Author": "John Ramirez", "Date": "December 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "span> Piece of junk, purchased to work with Ring Doorbell,  rarely worked."}
{"Author": "Alexis Brignoni", "Date": "September 26, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "eat</span> If you have the required phone and hardware (locks and kevo plus) you can control your locks from anywhere. I used rechargeable batteries for locks to save in costs. Works great."}
{"Author": "John Tompkins", "Date": "January 31, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works fine on Nexus 5x. And now it comes with unlimited free ekeys! Finally!"}
{"Author": "Roman I", "Date": "September 17, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Finally fixed android wear support"}
{"Author": "Yusuke Iwakawa", "Date": "January 21, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Got the OnePlus 3T and can't use the app. Really? Was working on the 6P..."}
{"Author": "Ricky Merrell", "Date": "December 7, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "on:</span> You should include a feature that logs when an ordinary key is used; just like when touch or ekeys are used."}
{"Author": "Alfredo Duenas", "Date": "September 19, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "Keeps crashing on Android Wear."}
{"Author": "Alexander Skrypko", "Date": "January 4, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Incompatible with Google pixel??"}
{"Author": "Sean Chung", "Date": "November 2, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Doesn't support Android Nougat."}
{"Author": "Jeremy VanDervort", "Date": "December 21, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as discribed. What else can you ask for?"}
{"Author": "Sean Lively", "Date": "January 11, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "n> Shouldn't have to log in every time the app starts."}
{"Author": "Ewerton P Araujo", "Date": "March 15, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It works very well with my Galaxy 6."}
{"Author": "alex kouris", "Date": "November 10, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "</span> Slow but it works so for now it's good"}
{"Author": "Donovan Walker", "Date": "October 11, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "eeds to be on.</span> Title says it all."}
{"Author": "David Hilliker", "Date": "January 7, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Works as expected on my  Galaxy S6."}
{"Author": "Peter Harbison", "Date": "March 28, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Thanks for adding Pixel!"}
{"Author": "Francis Ash Aranha", "Date": "December 31, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "an> Asks for more money."}
{"Author": "Hieu Do", "Date": "September 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "etty well</span> Opens the lock fairly consistently now."}
{"Author": "Douglas Ott", "Date": "February 1, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Mine has worked great from day one I love it"}
{"Author": "Kyler Khang Nguyen", "Date": "October 29, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "m</span> Good but need more improvement"}
{"Author": "Mike Smith Jr", "Date": "September 19, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "/span> App compatible with Note 7"}
{"Author": "Alexander Kundinger", "Date": "October 14, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Works better with note 5"}
{"Author": "Rich Schun", "Date": "May 25, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Good app."}
{"Author": "Jason Gordon", "Date": "October 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Garbage"}
{"Author": "Eric Michaud", "Date": "July 31, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "t working on Android wear</span> Come on guys it's been almost a year that the app is not working on Android wear even after 2 updates, the screen on my watch keeps going white with kevo app stop responding.. seriously I regret ever purchased your lock! No support from kevo they told me a few months back they knew the issue on Android wear and would fix it soon that never happened! 😠"}
{"Author": "Kristin", "Date": "July 30, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " update is a pain on Android!</span> What the hell is the point of spending almost $400 on 2 sets of locks if every time an app update comes out it never works?! Last time it logged me out all the time, now I can't even get it to pair. What a waste of money. NOT EVERYONE OWNS A STUPID IPHONE, KEVO! ANDROID USERS DESERVE APPS TOO!"}
{"Author": "Jimmy Kastner", "Date": "July 30, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "EVERY TIME I try to pair my phone</span> This app used to work okay for my Galaxy S5. I now have an S7 and I can't connect my phone to my locks. Screw you Kevo. You never address my concerns. Not spending another $25 on a cheap plastic fob that keeps breaking in my pocket. Two smart locks... $320 down the drain."}
{"Author": "Andy Bae", "Date": "August 21, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " far</span> Working like charm on the Nexus 6P so far. No excessive battery drain (on in background 24/7), never have to take my phone out of my pocket. It does sometimes take 2 tries to unlock, but not a big deal. eKey feature is amazing, but you are only entitled to 1 active key unless you go with premium. And in that sense, I do agree with Ray that the premium option is ridiculous.. I mean I paid $250 for the deadbolt. As such, I have also deducted 1 star."}
{"Author": "Gary Westfield", "Date": "August 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "The app has more issues connecting even just a few inches from the lock.  When it does work, it takes so long for the lock to respond.  Find myself just locking the door myself.    I would not recommend this product."}
{"Author": "Dave Dundas", "Date": "December 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Was great when I had my Samsung Galaxy 5, then I upgraded to my new Google Pixel, which runs Android 7.1, and it's not supported. We haven't seen this app updated since September, it's now December! Come on people, this is a very popular phone, and it now makes my Kevo lock pretty useless... There's no way it should take 4 months to update with new phones or OS's. I'll update this review if/when they finally update to make it work for me again."}
{"Author": "Sahra Grosser", "Date": "August 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " we get taken for a ride.</span> App sucks; doesn't work. But, seeing as how their lock is useless, I'm not surprised. There goes $150, 2 hours of my time, and the will to live. Thanks guys."}
{"Author": "Ray Malchow", "Date": "July 29, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "Lost one star because you want another  $180 in Canada to upgraded to Kevo Plus. For the price of the lock you should not be asking for more money to get all features to work. Other than that it works good with Samsung S7 especially after the latest app update.  Have had to open the app and use it a few times in the past to get the lock to work and then it seems to make it work properly again for  a while but since the latest app update it seems to be more reliable and works immediately ."}
{"Author": "Olam Ng", "Date": "September 9, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "s well but...</span> Unable to access manual calibration for mobile device Samsung galaxy S7 within the kevo app. After selecting the lock and it's settings, the calibration feature does not appear for selection as intended within the video faq."}
{"Author": "Ben Cadile", "Date": "September 19, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " unreliable</span> After upgrading my Nexus 5x and 6p to Nougat, I can finally update my lock. Additionally, after several updates, the app finally works on my Motorola 360v2 watch. The only issue I have now is with reliability. Proximity unlock works about 30% of the time. Sometimes I have to get my phone or and open the app, restart, or just toggle blue tooth. Regardless, reliability is low."}
{"Author": "Jeff Harrison", "Date": "October 6, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " my Note 7</span> Don't know if I'm just lucky but this app is great. The version I have is so snappy! Unlocks and locks the door within 5 seconds! Highly recommend to anyone that wants to leave the annoying house keys at home! Hope kevo keeps this app this good!!!😆"}
{"Author": "Chris Creasy", "Date": "October 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " trash</span> Got the lock installed key fob didn't work. Was told to update the lock. All it does is say don't leave the area then says unable to update. Don't know why I expected more."}
{"Author": "David", "Date": "August 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "s goes offline randomly...</span> Don't waste your time connecting to the NEST thermostat. Never can change from home to away. Waste of money on KEVO plus."}
{"Author": "Robert Hufault", "Date": "September 21, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "eat!  Love it but could be better...</span> Many bad reviews have nothing to do with the app and are regarding configuration/setup issues with the device.  I had no trouble installing, programming and using the device or this app.  I knocked one star off because occasionally if you accidentally touch the lock while shutting the door it'll lock as your closing it. IMO thats user error but should be a sensor on the device to prevent it from happening. Should include manual lock/unlocks in history &amp; key fob should have disable option, not require reset!"}
{"Author": "Zac Gruetzner", "Date": "August 21, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "pan> Never works with my Galaxy S5.  Kevo app constantly ignores request to lock or unlock.  If I hadn't paid $200 for the lock, it would be in the trash."}
{"Author": "Brandon Goulet", "Date": "September 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "</span> This app cannot be opened without crashing. Every time you do something on it, it crashes. Used to work great, but it has gotten increasingly terrible over time. I COMPLETELY regret buying this, and I would advise others to look elsewhere for smart locks."}
{"Author": "Real Ohio Ghostbusters", "Date": "August 25, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "ying skilled trade and fail.</span> This lock works perfect. The main complaints you will see on here are that the lock starts to work and fails or some compatibility issues with the app. The lock jammed on me, but I'm not dumb so I chiseled the hole on the door frame to make sure the lock cleared the hole. Amazing it worked. It's really crazy that following directions and critical thinking worked. Not some mindless regurgitation of facts. So do some research, and make sure you know what you're doing before you buy this lock and rate it bad."}
{"Author": "Kevin Moore", "Date": "July 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " garbage</span> I believe you guys don't respect your customers which is why your produced this crap they're clearly was no testing this is absolutely horrendous I would like my money back if I could this is ridiculous"}
{"Author": "Chris Barter", "Date": "August 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "App is poor...lock might respond after two to three attempts. New version continously crashes on android. I'm not impressed. Android wear is totally unusable since three versions back to include the most recent. Pathetic for the money we paid."}
{"Author": "Lauren Smith", "Date": "September 6, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "aaaay</span> Works fine on my husband's phone  (galaxy s7, primary Kevo account) but when I lock the door from my phone (galaxy s7) it jams every time. The door does lock so I'm not terribly concerned about the house, but the lock is going to wear out faster."}
{"Author": "jarryd stetler", "Date": "August 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " money.</span> App crashed alot, failed to recognize me as the owner and no longer let me update or even open my front door, and the 4 aa batteries died like every 2 weeks or less.. Total crap. Am now trying to reverse engineer it and see what I can do with it"}
{"Author": "Lo Ela", "Date": "September 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "rt for the Note 7</span> Can't use my phone to unlock the door anymore. Defeats the purpose of buying thw Kevo lock."}
{"Author": "samuel yamasaki", "Date": "September 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "ready for prime time</span> Very Slow to connect. I also have the august lock and the august software is far superior."}
{"Author": "Jose Crespo", "Date": "July 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ibrate phones</span> Thsi app  is the worse and my gear s2 stop working with new update"}
{"Author": "Phillip Dvoracsek", "Date": "August 4, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Recent updates broke the app. Had to go back to using a physical key until this is fixed..."}
{"Author": "Chia Hu", "Date": "July 29, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "after latest update</span> Works well prior to recent update. Now crashes every few minutes. Took me 5 minutes to get into my house today. Please fix."}
{"Author": "SUHAS M", "Date": "September 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "to lock feature!!</span> Needs auto lock, day after x minutes of being unlocked . also compatibility with other smart home systems like wink and ifttt."}
{"Author": "Saad Munir", "Date": "September 7, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "I am unable to install it on 5.0.2, it says device is not compatible, its Galaxy S4.   More Devices need to be added before this is useable"}
{"Author": "Roy Lorieo", "Date": "September 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ck outside and it is raining.</span> Doesn't work with a Galaxy S5."}
{"Author": "Jed Perlowin", "Date": "August 18, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "st of the time</span> Can't complain too much, but it's been working pretty good for me. Sometimes it doesn't connect, but does the majority of the time."}
{"Author": "Robby S", "Date": "September 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Huge drain on battery, barely works"}
{"Author": "Vybz", "Date": "August 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Need support for Note 7 (6.0.1)"}
{"Author": "Daniel Ochoa", "Date": "August 7, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "rfect</span> Have this app on my entire family's phones and works perfect. Great job guys"}
{"Author": "Scott Fischer", "Date": "September 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "ch better</span> Last update got it working great"}
{"Author": "Dustin Carpenter", "Date": "April 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " lock, Major Android Wear issues</span> Installed lock, set up app and everything worked perfect.  Came back and lock wouldn't open and couldn't get it to. Uninstalled and reinstalled app and is working fine.  Constant crashes on my moto 360 like other users are reporting.  Once fixed easily a 5 star app.  It has been a good couple months now and still no fix for Android Wear and there is no way to deactivate Android Wear support, every few minutes I look at my watch and it says \"unfortunately Kevo has stopped\", this seriously needs to be fixed."}
{"Author": "Kortney Simmons", "Date": "July 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "s for a lock that isn't compatible</span> 200 dollar for a lock and you still arent compatible with some of the newest phones out? I have a galaxy note 5, can't use it with this app.the note 5 had been out almost a year. The galaxy s6 and s7 Just got added to the list weeks ago. 200 for a tech device that doesn't keep up with technology? Wtf. But every ios device ever created is compatible"}
{"Author": "Samer Khatib", "Date": "August 28, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Pros: When it works it works great.   Cons: Every time I reboot the phone I have to log in again.  Sometimes I have to launch the app in order for it to do anything  I just got a Galaxy Note 7 and the app is incompatible with it. I either need to carry around a second phone that supports it or I cannot use the feature I bought the Kevo for.   Fix those 3 things and this becomes a 4 or 5 star app"}
{"Author": "Shannon Mayfield", "Date": "March 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ntil Recent Update</span> This app worked flawlessly until the recent update. Now, I can't open the door without a key and my Android Wear watch displays a \"kevo has stopped\" message every few minutes. The developers seriously need to revert whatever changes we they made."}
{"Author": "Shah Ahmad", "Date": "April 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "This has to be the worst app ever. The error on the Android Wear keep popping up even after multiple updates of the app and number so complaints from other users. This is not an isolated issue as it has been reported numerous time by users on Google Play. Either fix the issue or remove the functionality from Android Wear altogether. It is as simple as that. Will never recommend this product and will never use it again!"}
{"Author": "Margaret Priest", "Date": "June 13, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "I loved this app and lock. I even paid for the Plus, then I got the new Galaxy S7 and I have been told by Kevo that they don't even know if they are going to make this work with the Marshmallow 6.0. They need to get with the times and make this app work with newer technology. Not everyone owns or even wants to own an IPhone."}
{"Author": "Jim brown", "Date": "April 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "did what it promised</span> Android Wear not working. Updated phone,updated watch,updated app, and updated lock itself. All on latest version. Still doesn't work. Called customer support and they have no clue. They told me \"sorry i only know how to do stuff on apple\""}
{"Author": "Bryan Murphy", "Date": "May 16, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " lock. Hate the app and kevo plus</span> Love the lock. Have a love/hate the app. Lock works well and works great with Kevo plus. Challenges are app is not working on android wear and crashes when you open it.  Cannot use on android wear. They charge you for additional keys. Really?  Does not integrate with home automation products like Iris and SmartThings. Great stand alone product but a total miss for those that want to integrate with other products. Still does not work with Andriod but states is does? False advertising?"}
{"Author": "Brandon Blomquist", "Date": "July 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "update.</span> Ever since an android wear update 3 months ago, I constantly get a message saying \"unfortunately kevo has stopped\" and the battery on the watch drains faster because of the full white screen. I was told there would be an update, but it is July and the last update was in March. Every app I have, and my operating systems for both my watch and phone have had multiple updates since then."}
{"Author": "Eric Lopez", "Date": "April 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "et my uninstall kevo off androidware</span> All it does is say disconnected with a white screen and just runs down the battery on my watch.  Other then that your product has been perfect please fix or remove the Android ware app.  I have a Samsung live watch with a Nexus 6p no root."}
{"Author": "John Keller", "Date": "May 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "work</span> Worked fine for one day.  Now I have to uninstall and reinstall every day to unlock my door.   May be the worst app I've ever been suckered into buying.   RUN AWAY!   DO NOT BUY a KWIKSET LOCK"}
{"Author": "Jeremy Bible", "Date": "May 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "te needs to be rolled back</span> Since your latest update,  the app crashes my LG G Watch R every 10 minutes whether it is enabled for use with the kevo App or not. Since I need the app to open the door,  I can't remove it,  despite the fact that it's KILLING my watch battery. For the amount Kwikset is charging for hardware I'm certain you can afford some decent programmers. Says \"for an older version \" . It's still crap."}
{"Author": "", "Date": "June 10, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ld definitely offer a bit more.</span> Kevo is great on the Android.. But as the title says this is a hefty chunk of change for a deadbolt that you have to resign into every time you shut off your phone and where is the ability to setup lock and unlock alerts/notifications? Another feature that seems pretty simple to add to this device would be if there was say 3-4 attempts to open the door it sends you an alert would be nice to know if your kids forgot their key you would know or if someone was trying to break in/pick the lock."}
{"Author": "Ryan Anderson", "Date": "March 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "nonstop on Android N</span> I can't even get into the main menu. The app crashes immediately after opening it. You'd think a developer of an app like this (an app that gives people access to their homes) would update their app to work with new software ASAP..."}
{"Author": "Bobby Todorovski", "Date": "March 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "App is essentially broken at this point. It renders my Android Wear watch unusable as it continues to crash and block the screen. The only way to have this stop is to remove the app off the phone, thus rendering the locks unusable. This is frustrating beyond belief, get your act together and fix it! For the price you charge your customers, you need to deliver a solid stable product, and when bugs like this do inevitably occur, you need to fix them immediately. This has been going on for weeks now."}
{"Author": "Gordon Carskadon", "Date": "March 24, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Still far too many Kevo taps where the lock does nothing; it needs 99% success rate for taps when the phone is in my front pocket, but I'm getting somewhere between 50-75%. It has been better since version 1.2.24p and the updated lock firmware 1.4.13. Previously I was getting lots of missed taps. The Works With Nest integration is awesome. Nest's Auto-Away is garbage, but having a quick option to set the Nests to Home or Away mode based on unlocking/locking the door is fabulous."}
{"Author": "Michael Reilly", "Date": "April 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "App gets worse with every update.  No longer runs in the background.  No longer connects to the lock unless I start the app and push the open button in the app.  It has started asking for my password all of the time.  The last good version was 1.0.27p.  Luckily some members of my family never update so we can still uplock the door without dropping everything to run the app.  Looks like Kwikset has given up on the Kevo.  The google+ group has been abandoned since last November."}
{"Author": "Colin Shannon", "Date": "March 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "work</span> The icon to set up a lock is completely grayed out as are all the other options. They do nothing while trying to configure it. I'll be returning the lock as defective because as it is this is a waste of money."}
{"Author": "Julian Ang", "Date": "July 20, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "It is working great now with my Nexus 5x. Just need to be more bug fixes like door will not open unless I turn on the screen. Just wondering, when will you open it to all Android 5.1 and above phone? this selective phone you got going is ridiculous."}
{"Author": "Josh Bodine", "Date": "April 11, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "I have tried to update the lock a bunch of times to no avail. I have followed the instructions carefully and have even attempted to ready the lock a couple times. Still, every time I try to apply the update with my phone it says it can't connect. Other than that everything functions fine.  Edit: in order to update, I had to not only reset the lock, but also remove the batteries for about 30 minutes, then go through the setup all over again. Not happy about it, but once it works, it works great."}
{"Author": "David Schamis", "Date": "June 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "This is really pathetic.  Two really major problems:  1. When I originally bought it it worked with the Nexus 5X - now somehow it doesn't and I can't even download the app to my wife's phone.  I have it on the 6P but if I ever took it off I wouldn't be able to put it back on - absolutely ridiculous, especially for something that is supposed to be as essential as a lock for your home.  2. Constantly, and I mean constantly, crashes on Android Wear, and there is no way to disable it on my Wear device.  I have no interest to open my lock with my watch (and no confidence that it would work anyway) - please remove this \"functionality\" so I can use my watch.  This is really really unacceptable!"}
{"Author": "christian zilinski", "Date": "May 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": ", inconsistent and poorly designed</span> There are many issues with the kevo. I am aware of how smart home devices SHOULD  work and where issues may lie and kevo still falls VERY short of a quality product. It is an absolute joke that additional keys for your already purchased product cost money, especially at the price tag of this unit. It has poor app design, this product is very inconsistent and claims of app compatibility with other smart devices feels more like a trick. There is potential here but it is far from a quality product now."}
{"Author": "Andrew Sumowski", "Date": "June 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " guys given up on this app?</span> Just wanted to let you know I'm very disappointed with your product.  I thought buying a kwikset product would be a good idea but I was mistaken.  I have a YouTube channel and I will be featuring  your product soon with a very poor review.  I spent a lot of money on this and feel ripped off."}
{"Author": "Becky Stadler", "Date": "March 22, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ndroid wear</span> The app and my lock both work fine, except the app keeps crashing on Android wear since the last update. I have no option to disable it from my watch so please fix or remove the feature. Every 30 minutes or so I get a message on my watch saying the kevo app has stopped working. I have the Android wear feature turned off on the app, but it's still installed and crashing regularly on my watch."}
{"Author": "Conrad Shehan", "Date": "April 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "en with marshmallow</span> Android wear pop-up every 10 minutes saying Kevo has stopped responding. Uninstalling app. Get your act together kwikset. You know about this issue, so fix it."}
{"Author": "Ace Wagner", "Date": "March 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worst idea executing a product ever.. Hard to install, have to have supporting phone. If u send a \"key\" to somebody they have to have proper phone, get the app, get a key.  Just mail a key to somebody you wanna let in.  Better use a number pad in the door instead--- DO Not BUY--- needs massive improvement!!"}
{"Author": "Brett Logan", "Date": "April 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "y breaks Android Wear</span> This app was working fine until a few weeks ago... it's now unusable. The app crashes every 10 - 20 minutes... And whether or not I have Android Wear notifications enabled or for this app, I get a notification on my watch EVERY 10 - 20 minutes (which takes up the whole watch face) telling me the app has stopped responding, which I need to manually clear. This means I need to choose between wearing my watch and having access to my front door... Not cool. Please fix"}
{"Author": "Brad Forrester", "Date": "April 18, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "eps crashing, burns up battery</span> Moto 360 and LG G4, app keeps crashing on Moto 360 watch, burning up the battery even while disconnected. Can't force it to stay off watch, even with permissions denied. Uninstalling until updated, stay away!"}
{"Author": "Ben Steele", "Date": "July 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "so Far</span> I have been waiting to buy a Kevo for a long time. As soon as I saw this app was available I ran out and bought a Kevo. The app has been working perfectly so far. I had a few problems with updating the lock but it worked eventually. I haven't had any problems unlocking and locking my door yet."}
{"Author": "Bates Moses", "Date": "May 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "s works, sometimes doesn't.</span> Clearing cache temporarily gets it working again.  Getting tired of trying to troubleshoot this device.  Purchased the recently released remote access device also... Expensive... And also doesn't work.  Deleting, app works fine on iPad and iPhone..."}
{"Author": "Chad German", "Date": "March 22, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "erfectly. Walk up and touch lock with thumb and it unlocked.  But charging for extra for a digital key is not cool.</span> Use your thumb and make the lock light up with fob key or phone near. M9 marshmallow. Update. Months later still works perfectly except on Android wear moto360 2ND gen. Force closes constantly."}
{"Author": "Buck Bell", "Date": "July 4, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "To be clear, the lock is terrific!  The fob is terrific.  The app is terrific.  The Android Wear component is a total nightmare that repeatedly crashed and alerts on the phone, dozens of times a day.  It's not OK, and the only solution offered is from the online community, requiring some additional tools and minor scripting skills to disable it.  Really?  UniKey has had months to address this and has not.  The only mainstream option is to remove the app from the phone, which is not a reasonable solution.  FIX NOW.  Buy the lock, use the fob, and use the app... as long as you don't use Android Wear."}
{"Author": "nate shapley", "Date": "August 14, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Prior version worked fantastically with my Lollipop Droid Turbo 2. Add in a Moto 360 and it worked half the time. Now it's completely broken with Marshmallow, and it says the newest version is not compatible with my phone. Would be 5 stars if I could use my lock again."}
{"Author": "Robert Scarlett", "Date": "April 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " Kevo Plus</span> Basically this was my worst purchase this month. The video looks amazing and that is what I thought I was getting. Total letdown locking and unlocking is 50/50 at best. Gone back to using a key now. Oh yeah Kevo Plus remote Bluetooth gateway is rubbish can not even see any menu options to remote unlock and app continuously say it can't find the lock. Looks like there is a lot of ripped of people, myself included!😭"}
{"Author": "Nick West", "Date": "April 3, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ly breaks on moto 360</span> \"Unfortunately, kevo has stopped\" constantly showing on my Moto 360. I would rather not have it on my watch than have it breaking every 10 minutes."}
{"Author": "Adam Gillick", "Date": "April 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " crashing on Moto 360 (2015)</span> Every two seconds I get a crash notification on my watch..this has been going on for over a month..time to fix!  How can you partner with Motorola/Android Wear to promote the Kevo feature when it first launched and all it does is constantly fail?  Ridiculous."}
{"Author": "Cesare Coscia", "Date": "June 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Watch app constantly crashes otherwise it's a good app.  I love the Kevo as hardware but the software needs to be just as reliable.  Edit: downgraded to one star. Three months later and Android wear support is still broken."}
{"Author": "Gerry Lawless", "Date": "April 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "on't Work</span> Sending the ekeys doesn't work without calling Kevo and getting them to authorize them. What's the point of this system if the most important feature does not work. Their server went down for a weekend and nothing could be done. Hardware fine, software garbage."}
{"Author": "Heith Rogers", "Date": "May 2, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Moto 360 Second Gen and Samsung Galaxy S7 Edge:  Unfortunately the Kevo app has stopped. Unfortunately the Kevo app has stopped. Unfortunately the Kevo app has stopped. Unfortunately the Kevo app has stopped. Unfortunately the Kevo app has stopped. Unfortunately the Kevo app has stopped. PLEASE FIX THIS BUG.  IT POPS UP ON MY WATCH CONSTANTLY. Very buggy software.  My key fobs both stopped working months ago and no amount of resetting the lock or app fixes the problem."}
{"Author": "Robert Richie", "Date": "May 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "After update I can no longer use the app on my Nexus 6P. I had it installed and configured and it was working decently. I'm not even able to install the application on the same device that it was previously installed on after resetting the device. Now I cannot unlock the lock with any devices rendering the functionality special to this device useless.  Please resolve this issue quickly."}
{"Author": "John Valletta", "Date": "July 20, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "s to be power hungry</span> If I let the app run in the background it chugs battery life normally im getting 18 hours with S7Edge now I'm down to 10 since app download. Use it the device has been great seems a bit loud but otherwise works well. Fix the app and maybe the next Gen. May be quieter. Hopefully"}
{"Author": "Tristan Caulfield", "Date": "May 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Causes AndroidWear devices to constantly crash.   Kevo has been promising an update to correct a serious bug in the androidwear mini-app since February, but has yet to deliver and has no ETA or timeline when users can expect the update."}
{"Author": "Brandon Wardlaw", "Date": "March 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Wear plugin constantly crashes, Kevo Plus unpredictable</span> Android Wear plugin constantly crashes even when disabled. Kevo Plus gateway never works reliably. Super close to abandoning Kevo and using a Z-Wave lock instead."}
{"Author": "Donald Glaser", "Date": "April 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " works. The app doesn't</span> I have to renter my password almost daily. I also constantly have the \"kevo application has stopped\" on my watch. That's slightly annoying, except that my android watch uses a bright white screen to convey this message, which kills the battery. I can either use the Kevo app which works half the time or my watch."}
{"Author": "Sean Reifschneider", "Date": "March 20, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "forget login credentials</span> This app updates a LOT, weekly or every other week, and every time it does it forgets my login. Now, I use a strong password for this, as it is literally the keys to my kingdom. It is both long and hard to remember, which means that I really can't rely on this lock and have to have a key."}
{"Author": "Ken Phillips", "Date": "May 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "lable</span> I purchased the kevo in Canada with the assurance kevo plus was available. I've been waiting over a year and still not in Canada. What a scam this product is. Do Not install if you want internet access in Canada!!"}
{"Author": "Kristofer Northrup", "Date": "May 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "I just purchased a new 2nd gen Moto 360 watch. Recently, the Kevo lock and app have been functional, if a little unreliable (~80% success rate locking and unlocking). Whereas before the app would lose access to my phone's Bluetooth, requiring me to turn Bluetooth off and back on before I could lock or unlock my door.  Now, after pairing my watch, I found that Kevo stopped working altogether on my phone. I also now have regular Kevo FC messages on my wearable. Honestly, metal keys are far less frustrating.  UPDATE:  My 4-year-old daughter just unlocked our door without any key nearby, even inside the door in our house.  A little testing shows that anyone could have unlocked my door at any time.  This is UNSAFE!"}
{"Author": "Donald Ironside", "Date": "July 18, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " won't leave sleep</span> The Kevo app shows in my notifications that it's in sleep mode and says move your device to wake but it does not work. It just started doing this. Now every time I come up to the door I have to pull out my phone and open Kevo app to get in. It is really annoying. Girlfriends phone does the same thing so it's not my phone. Please update or this lock will be returned due to it being a regular lock most if the time now."}
{"Author": "Jordan Willis", "Date": "August 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "You j*rkoffs, my mom bought this thinking she was getting a great device for easy locking and unlocking of her home. Little did she know, of course, and like most people her age who do not know to look deep into compatibility issues with certain devices, found out that it does not work with her LG G4. Why does your app not work with one of the most popular android phones ever released?"}
{"Author": "Cameron Mayfield", "Date": "March 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "pdate is broken</span> Android Wear crashes constantly and I have to unlock my phone to get the lock to unlock. It was going so well..."}
{"Author": "Jesse Wilson", "Date": "April 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "he deal!?!?</span> It has a mind of its own! Only works when it wants. One minute just fine, forget something in the house then the app won't connect or it just logs you off, AND I JUST USED IT! It's the same for both people who use android device with the kevo. It worked flawlessly when first purchased. I don't get it. I hate it!"}
{"Author": "Chuck Lynch", "Date": "April 26, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "t but...</span> If you can't fix the functionality for Android wear (specifically the LG G Watch R) then just remove it. I'm tired of having to dismiss the \"Unfortunately, Kevo has stopped\" error multiple times in a row and multiple times a day. Other than nut being able to use my watch the way it is meant to work, it's a great device and app."}
{"Author": "Travis Ryan", "Date": "May 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "stency!</span> Why does the lock work perfectly one hour then the next hour you need to fumble with your phone to \"open\" the app when it was never closed? I've had this for a month and I have not been able to rely on this product at all, thank goodness I keep the real key on my key ring to get me in the house when the app decides to not respond!! Great concept but terrible performance. When does the next \"upgrade\" come out? For being Bluetooth based this is lousy, fix ASAP! Will the developers actually listen to us?"}
{"Author": "Aaron G", "Date": "April 9, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "low and Wear</span> Works fine with just the phone but recently no longer works with Wear. Constantly says Kevo has stopped. Very annoying. Would rate higher if Wear app worked."}
{"Author": "Rolando Ramos Ramos", "Date": "April 13, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "in me out</span> Have to enter my password everytime, before was fine,  this defeat the purpose of handfree key lock. ..it is just easier to use the key. Please fix it,  otherwise is just a waste of money"}
{"Author": "Maurice Banks", "Date": "June 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " Bugs</span> This app worked great until Android Wear updated to 6.0.1 Marshmallow. The app continuously crashes...even when not in use. I have had to completely uninstall the app from my phone because it was rendering my smart watch useless. FIX THIS!"}
{"Author": "Harvey Z", "Date": "July 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " lock. Could be great...</span> When it works you realize how convenient a smart lock can be. However it rarely works problem free for longer than a few days making it impossible to trust as a primary door lock. Kevo Plus needs major improvements. The app never gave up to date status reports and when unlocking and locking remotely I found that it worked the first attempt only 10℅ of the time. Most often multiple attempts were needed taking upwards of 5 minutes to finally unlock. I purchased 4 locks giving Kevo as much a chance as possible"}
{"Author": "Scott A", "Date": "April 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "</span> The app is always asleep.  Whoever allowed this product to be released should be embarrassed.  I could cut a hole through my door with a butter knife faster than this thing could open a door."}
{"Author": "Jeff Muirhead", "Date": "May 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "it have to change???</span> I really loved this app, and lock. Until the past month when the update happened. Now I have to stand outside my house at the front door like a dumbass, trying to log into the app. Why does the app log out automatically now?????? Please fix or I will switch to Schlage."}
{"Author": "myke walker", "Date": "June 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "tch app crashes</span> Watch app crashes constantly, returned lock mechanism as well because it is not precise and thinks people are touching it when the wind blows, even after calibration."}
{"Author": "Billy Lucas", "Date": "March 16, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ntial</span> The latest version did indeed break the functionality.  Lock no longer unlocks.  The app has a lot of potential in my opinion.  I love the send e keys etc but they've gotta get this dialed in."}
{"Author": "John Cortese", "Date": "March 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "fine until today</span> Today  I was unable to lock my house the phone would vibrate but the lock didn't lock trying to reinstall but after the last update I have to resign in every time I try to use it"}
{"Author": "Kelvin Antaw", "Date": "June 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "uy this rubbish</span> Seriously it's not worth the hassle. Use a key, the bluetooth connection is problematic and always a pain."}
{"Author": "Ken Jamieson", "Date": "September 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "/span> Can't turn on in Note 7 as it drains battery but it doesn't matter as I pulled the batteries out of the lock months ago anyways and back to using a regular key.   Automatically locks everytime I went in and out, I pull the door closed as I walk through it and it automatically locks the dead bolt before the door is even closed!   Touch controls only work once in a while... Ridiculous that there are no settings when you want it to lock or not.   Can't believe Weiser would join up with garbage like this."}
{"Author": "Darrell Whitmire", "Date": "April 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "RY!!!</span> Now I can't use my phone to unlock my door because I now have a Galaxy S7 Edge.  Update your app to work like it should...WITH ALL PHONES!!!   Even with Kevo Plus it doesn't work.  That was a waste of $70."}
{"Author": "Alison Priebe", "Date": "May 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work. It used to work on my phone and smart watch, but now it doesn't work at all. App-solutely pointless."}
{"Author": "Juan B", "Date": "May 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "duct.</span> Last update rendered useless Android Wear making it crash immediately after opening. It was working fine. Edit: 2 months passed by and still no Android Wear. Wow."}
{"Author": "Nick Friedmann", "Date": "May 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "How is there not a release for Android 6.0?? I bought the kevo lock before upgrading my phone to the galaxy s7 edge which runs Android Marshmallow. Much to my chagrin, the Kevo App is not compaible...Now my lock is no better than any other lock; I have to use a key! The whole point of buying the Kevo was so I could enter my house by way of phone.   Android Marshmallow dropped in October of 2015....  Updates to the app have been made since. Will this app ever be updated????"}
{"Author": "Kaj Sorensen", "Date": "March 30, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ks flawlessly, app hardly works at all</span> I have no problems using the kevo on a day to day basis with my phone in my pocket and touching the deadbolt, however the app will not stay open on my Nexus 6P. As soon as the app detects my kevo it closes itself without any warning, which means I can't manage my ekeys from my phone if I'm in my house with my Bluetooth active. Thankfully I don't use the ekey feature often, but the app needs to be fixed."}
{"Author": "Freddie Vaziri", "Date": "August 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Not compatible with Moto X Pure  I can't even install it on the Moto X Pure. I used to have a Samsung S5 and had the same issues as other reviewers. at least I could use it on the Samsung but it worked intermittently. The key fob is not any better. The lock likes to engage while I'm trying to close the door, which is very annoying. Good idea but piss poor execution. Kwikset needs to get it right before releasing a defective item to the public."}
{"Author": "Steve Olock", "Date": "July 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "The android app is a festering pile of poo. It is a battery pig, it has a wear component that crashes 12-20 times a day. The functionality for wear isnt active until wear 2.0 comes out, and you cant disable it from running the wear component so a 2nd and 3rd poke in the eye. I had to use my wifes iphone to update the locks, then uninstall and reinstall the android app to get the locks to work with my android nexus 6p.  Unikey does NOT respond to requests for help from their webpage or the kevo page. The lock is excellent, the software is poop. They should be embarrassed and their mother should smack them. This is a perfect example of the need for less than 1 star in the rating system."}
{"Author": "Mark McKinney", "Date": "April 26, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " did not buy this lock!</span> I followed the instructions and set up my android phone (S6), and my wife's iPhone 6, the fob for my younger daughter, added an extra ekey for my oldest daughter and gave my scared of Technology mother a phiscal key. Set up the inside vs outside detection on everything and waited for stuff to go wrong. It all works. Next time I go to the mall I will pick up 2 more fobs for guests and my youngest son. I will change this review if things change but for now I'm 100% satisfied. FTR the iPhone app is much nicer."}
{"Author": "Tyler Black", "Date": "March 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "I want to rate this better , but the Kevo Android Wear app continuously crashes, since the Wear version 1.4 was released.  Every 5 minutes, my watch \"Crashes\" while this app is installed.  Please fix."}
{"Author": "Nydia Olaira Alvarez", "Date": "March 31, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "eat</span> On my android my husband has iPhone and it doesn't always work perfectly for him... it's about device not Kevo software I'd great."}
{"Author": "Thomas Clancy", "Date": "June 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "I'm about ready to toss this lock into the bin.     History: Prior to purchasing a $900+ phone I made absolutely certain it was compatible with the lock (Note 4 Edge w/ Lollipop 5.11 - STOCK).    Got the phone home, only to be advised by Google Play that the app is incompatible.   After a few days, and many hours with tech support, uninstalling, reinstalling etc. etc. it was finally resolved by them tweaking something on their end.  Current Status: Update phone to Marshmallow (6.0.1 - STOCK) a few weeks ago, and all continues to work fine.  Reset my phone to factory tonight, go to download app and the farking thing is telling me it is incompatible.  This is utter crap.  It has been working just fine under Marshmallow for weeks.  Now I have an expensive lock I cannot lock/unlock VIA the phone.  This is clearly the ONLY reason to purchase said lock.   Y'all need to allow the app to be loaded, or refund my money.  I'm tired of hoop jumping."}
{"Author": "Aaron Senn", "Date": "March 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "work</span> On my second replacement device and does not work. 1/10 times it opens the door....if you're holding your phone an inch from it"}
{"Author": "Neil Evans", "Date": "May 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "This app continually crashes on my android wear watch, i have had it loose all the locks attached to it and will not always open the doors (I've actually found it faster to use my key).  It has become so unreliable that I'm ready to uninstall it from my phone.  I got the hub so that i would be able to unlock doors remotely but of course it a rare time that it actually does it.   For the amount of money charged for the locks this should be way more reliable and constantly updated to work whit new versions of android"}
{"Author": "Karl Thomas", "Date": "March 26, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " be updated for Android M</span> Watch app just crashes since upgraded to Android Marshmallow. Please update the app so I can use the watch app too."}
{"Author": "Rachel Moen", "Date": "May 19, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "u out</span> After the most recent update, about every other week at most (sometimes less time) I am signed out of my account and don't know this until I'm trying to lock/unlock my door and it doesn't work."}
{"Author": "Denis Quintal", "Date": "April 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " time</span> It's faster and easier to use a key then login to this buggy app every time I leave or come home."}
{"Author": "Jls Lamontagne", "Date": "May 1, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "depuis la derniere mise à jour   Marshmallow 6.1  j ai un problème de communication Bluetooth alors il  devient difficile voir impossible d ouvrir la porte avec ce  Apps. mise a jour ! après une reconfiguration complete c'est a dire reset avec nouvelle clé je peux dire qu'il est compatible avec Marshmallow 6.1 car kevo fonctionne avec Samsung S7 edge"}
{"Author": "Wendy LaCrosse", "Date": "July 1, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "d loses connection</span> The lock jambs itself everytime I lock it and now it lost its Bluetooth connection and my app doesn't have the calibrate option. Paid $350.00 for trash."}
{"Author": "Craig Neiberding", "Date": "May 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked fine on my S7 for three weeks, then i upgraded my software now says not compatible. Not happy at all, as on the app it says 5.0 and up"}
{"Author": "Phillip Smith", "Date": "June 6, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Wear Fail</span> Kevo app errors out on LG watch Urbane 2. Constant \"unfortunately kevo has stopped working\" Please fix issues!!!"}
{"Author": "Steve Pepp", "Date": "May 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "y money back</span> Calling them tomorrow. I was being patient that there would be an update once my S6 was updated to the latest version. This is ridiculous."}
{"Author": "Shawn Green", "Date": "March 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "nd guest keys it says failed over and over</span> Can't send guest keys please fix it just says please try again I've tired like 10 times with different email from the android app and the Web interface.."}
{"Author": "Jeff Estevez", "Date": "April 4, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "y this lock!</span> I bought this lock and downloaded the app and it worked for about a week and didn't work that well. My daughter has an iPhone and it's not any better.  Tried to use the key fobs and the keep loosing connection. The worst, most expensive dead bolt I have ever purchased! Not sure if it's the app or the lock itself but don't purchase"}
{"Author": "Mike Powell", "Date": "March 28, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "dd Support for more devices!</span> LG v10 working inconsistently with lock.  Kevo plus is a nice feature"}
{"Author": "Peter D. Townshend", "Date": "July 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "me bugs, not all</span> Apparently there wasn't really a compatibility problem, because this is working on my Nexus 6P just fine now. It also looks like they have fixed the auto logging off bug, so thankfully I don't have to re-enter my password every time I want to use my lock anymore. Unfortunately, the Android Wear component of this app isn't working right now. Even if I don't even try to open it I keep getting a full screen message that it has stopped working."}
{"Author": "Nicholas Wiersema", "Date": "May 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked perfectly for six months before it crapped out. Two replacements locks from kevo and neither one works any better. Hoping for a refund."}
{"Author": "Alex Ives", "Date": "April 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ify account. It doesnt send the verification email address.</span> Never get verification email to activate account. Tried multiple email addresses to no avail. This is rubbish."}
{"Author": "Richard Séguin", "Date": "April 9, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "work flawlessly</span> Since the new Android 6.0, nothing works. The new app just got released an hour ago, so I had to reset my device to add my new smart device as main key (otherwise it didn't work). On the app, I can't find fhe calibrate option. So I can only open the lock with the app, not my phone. Please fix, and all will be great again."}
{"Author": "Rob Phillips", "Date": "March 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "on</span> Hope you have an iPhone, this version does nothing but crash on Android N Beta."}
{"Author": "Ethan Angi", "Date": "April 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "UY, COMPLETE CRAP</span> Bought one for the front door, the latch was defective, spent 2 hours trying to fix it, returned it, second one had the same problem, this is the worst thing I have ever seen, do not buy it"}
{"Author": "Chris Gage", "Date": "June 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo seemed like a good idea.  The deadbolt is expensive, yet they have the audacity to charge extra money ($100) for the \"functioning\" version of the app and hardware (check / lock / unlock out of bluetooth range).  They also would like you to pay extra for VIRTUAL KEYS!!!  Really?  The Kevo does not link with the home automation hub, Wink, not sure if it works with Samsung or Apple's automation products, remote access requires their junk.  The lock doesn't work if you're already paired to a bluetooth device.  The app force closes on my Moto360 watch.    The physical quality of the lock is about a 3/10, I'm pretty sure you could defeat the lock with a decent screwdriver.  The lock is very loud, both mechanically as well as the beep tones if you leave them enabled.  This one is going back to the store, I'll stick with a good old regular z-wave lock, my Wink hub loves z-wave.  If someone is going to break in, I'd rather it be a hacker than a kid with a screwdriver.  Nest integration works ***great.  You lock the door and it tells the Nest to cook the remaining occupants in the house."}
{"Author": "Dennis Z", "Date": "July 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "It's very embarrassing to have a high tech door lock but somehow the company doesn't keep up with it.   My Note 4 got stolen so had to replace it, figured I wouldn't have any issues with it being its a new OS (Marshmallows) dumbfounded that Kevo does not support note 5 but was able to work with note 4?   I ended up using the beta version, called tech support and I was told not to use the beta and use the key fob instead(which also doesn't work well)  Very stupid kwikset, you should stop selling this product !"}
{"Author": "craig cory", "Date": "July 4, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "but problems</span> Every time I lock the door from the inside, the door unlocks itself about 3 seconds later.  Really need to fix this problem"}
{"Author": "Travis LeMoine", "Date": "December 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "I have four Android devices, how is it possible that it's not compatible with ANY of them, when they were previously compatible?"}
{"Author": "Daniel Brown", "Date": "March 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "every 10 minutes on Android wear</span> You can't turn the smart watch all off... And every 10 minutes it pops up telling me it crashed. Nexus 6p - 6.0.1  and. Hauwei watch - 6.0.1"}
{"Author": "Moe B", "Date": "June 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked ok on samsung s7 edge but now using lg g5 and the app not even compatible.  Please fix this issue"}
{"Author": "Denis L", "Date": "July 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "App works well but I cannot calibrate my phone so the lock opens when I'm inside the house??? There is no \"calibrate\" setting...  Found out that my device is not supported, even thought it has the latest bluetooth profile.  Seems like they are limiting devices for the app just so that you have to buy plus, ridiculous."}
{"Author": "markieg g", "Date": "March 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo never sent the conformation email. when I called customer service she said she reset it and then hung up on me."}
{"Author": "Alp Ertunga Isin", "Date": "May 31, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "shing on android wear</span> Keep crashing on my watch draining the battery please fix."}
{"Author": "Robert Torres", "Date": "July 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "rk on Android wear</span> App keeps crashing on my Moto360 sports also buggy on phone at times."}
{"Author": "Greg Freyenberger", "Date": "March 31, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "on Android Wear</span> Crashes on Android Wear watches and won't unlock via Bluetooth consistently. Support is a joke. Do not buy!!!"}
{"Author": "Mark Jackson", "Date": "May 11, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "date</span> App needs Update to be Android 6.0 compliant. Wish my Nexus 6p worked with the app."}
{"Author": "Nick Brandt", "Date": "March 21, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Can't even sing in the app to use on my lock since the new update. Fix it!!"}
{"Author": "David Willig", "Date": "March 18, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "port</span> No N support yet.  App just crashes"}
{"Author": "Dewey Sutich", "Date": "March 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ose Android Wear</span> Concur with everyone with this issue.  Watch app freezes like a dozen times a day.  Really?!?!?!"}
{"Author": "David S", "Date": "June 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "oogle Wear</span> Constantly crashes on Wear. No real way to fix it. Searching shows this is a widespread problem."}
{"Author": "Konquered Balance", "Date": "April 6, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "y slow</span> This app works well from outside house but awfully while inside.  I do b there typically have any issues when at front door but if I am in the basement or upstairs in the bedroom. And want to unlock the door it takes forever (approx 20 sec on avg) to unlock the door then another 45 sec to a minute for it to update on the app telling me it's locked/unlocked. This had gotten even worse since I added the kevo plus."}
{"Author": "Andrew Tilson", "Date": "September 8, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Worked fine for a while but since the last update on my note 5 it no longer works."}
{"Author": "Louis Stabile", "Date": "April 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "It don't work with my phones"}
{"Author": "Sveta B", "Date": "May 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "drain.</span> Will also fail Google Wear watch if you have one."}
{"Author": "Paul Masters", "Date": "July 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Wear</span> Need it for the lock but it is constantly crashing my smartwatch."}
{"Author": "Sergio Soto", "Date": "July 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ately kevo quit working</span> I keep getting a error message on my moto 360 2nd gen that kevo has quit working... How do I resolve..."}
{"Author": "Benjamin Low", "Date": "April 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Android Wear is completely broken - Kevo won't even open."}
{"Author": "Serdar Önal", "Date": "March 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "y!</span> Horrible. Just, horrible."}
{"Author": "Marcio Acevedo", "Date": "June 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "It doesn't work with Samsung note 5"}
{"Author": "B Davis", "Date": "April 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "ching lock</span> Have to keep touching lock until it eventually works. App seems to not wake to respond to key lock. Sucks with arm full of kids and food. Works good with key fob."}
{"Author": "K. Anderson", "Date": "July 5, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo allowed everyone with Bluetooth 4.0 to download, and then pulled the rug from under them. Now I can't get in my door. Good job Kevo."}
{"Author": "Alphonzo Baylor Jr", "Date": "April 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "roid wear support.</span> Does not work"}
{"Author": "Cory King - Phillips", "Date": "May 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't install with s7 edge what is wrong with you people with just making it for 5.x"}
{"Author": "Nick Foti", "Date": "March 22, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Latest update keeps crashing on android wear"}
{"Author": "TheEgger", "Date": "July 23, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "Android Wear constantly crashes. App is cumbersome and outdated."}
{"Author": "Tom", "Date": "April 30, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "s me out</span> Logs me out of the app about everytime i need it. Switching to something z wave enabled instead to work with my smarthings hub."}
{"Author": "d. brown", "Date": "March 20, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ing on Android N preview</span> Not working on Android wear Moto 360 1q gen on Android N preview"}
{"Author": "Chad Dudenhefer", "Date": "August 10, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "</span> It's works ok on my S7, no real issues,  wondering if I should update,  probably not,  any suggestions?"}
{"Author": "Capitan Carga", "Date": "March 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " work</span> Doesn't work for android device."}
{"Author": "D Echols", "Date": "March 16, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "e cooking</span> Remote lock and unlock are working again."}
{"Author": "Gayatri Reilly", "Date": "May 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Still doesn't work with 6.01."}
{"Author": "Mike Morris", "Date": "July 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "wear Moto 360 Sport</span> Not working with Moto 360 Sport, keeps force closing, even after reinstalling."}
{"Author": "Jeff Weeks", "Date": "July 28, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Let's home the new update is not a larger piece of S@#T then the last one."}
{"Author": "Massimo Caradonna", "Date": "March 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "why can't I calibrate my note5. I can unlock with phone indoors."}
{"Author": "Ronald Bussard", "Date": "July 2, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "k/unlock widget</span> Also needs to support more devices."}
{"Author": "Ivan Pantoja", "Date": "March 17, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "te works now</span> Uninstall the app and reinstall new version"}
{"Author": "Chris Montgomery", "Date": "March 16, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't even get a confirmation email"}
{"Author": "Willmar Castro", "Date": "June 6, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Thanks for including the S7 edge!!!  &amp;lt;3"}
{"Author": "Ryan Mills", "Date": "September 2, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Can't install on my Note7. What???"}
{"Author": "Ernesto Pantoja", "Date": "May 30, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "oduct!</span> Works very well, easy to install and really useful."}
{"Author": "Gary David", "Date": "May 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "No support for the Galaxy S7"}
{"Author": "John Ruciak", "Date": "July 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Install \"Advanced Settings for Android Wear\" to get rid of the app on your watch."}
{"Author": "Jing Tao", "Date": "March 27, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "crash on android 6"}
{"Author": "Jose Word", "Date": "June 10, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " set up again..let's hope it's as good as it was.</span> Gs7e"}
{"Author": "shivam takulia", "Date": "April 28, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "wear</span> crashes on android wear"}
{"Author": "Bruce Hunter", "Date": "June 9, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "/span> Works great with S7"}
{"Author": "-ifrozeup-", "Date": "June 29, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "/span> This app does everything it says it does. Love it!"}
{"Author": "Christopher Dawson", "Date": "March 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Real Funny</span> I brought this device a month ago for it's coveniece, it was a 4/5 before the update for Samsung Galaxy S5. Fast forward. This thing takes so long to read my device on Bluetooth. It unlocks when it wants to. This better not be to get us to buy that $70 Kevo home. Fix it or give me my money back."}
{"Author": "Sam Villalon", "Date": "March 15, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " was good for a while...</span> I had no problems with the lock but now that I got the S7 with marshmallow the lock won't work. I clicked on the app to open from my moto 360 but it says that it will work with an app update. I got the app up to date! Always a problem! If I want to deal with something, I can just attach a key to my hip..."}
{"Author": "Myke Stanton", "Date": "March 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "L!!!</span> updated the app and now it doesn't communicate with the lock at all.  Updated to marshmallow yesterday and now I have to use my physical key.  Please fix and I'll happily change my rate.  P.S. Windows phone compatibility should be up there on the to-do list. UPDATE did it again.  No reason."}
{"Author": "Alex Naillon", "Date": "March 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ceived confirmation email</span> I have tried multiple times and never received confirmation email.  Tried on another S5 with same issue.  Tried different emails also.  It does work on iPhone but I have S5.  Very disappointing.  Learned this after installing hardware and ready to remove product and go with another door lock. :("}
{"Author": "Garth Land", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "t, now broken</span> App on my watch crashes every few minutes since update. Makes the Kevo useless as I will have to uninstall the app!  Save your money, just buy a regular lock!  I emailed their support and received a response that the email was full!  Received a survey later asking how helpful their support was, gave them a zero, asked for a call back, and still nothing!  Worthless!!!"}
{"Author": "Ryan Shuta", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "oid Wear issues</span> Please fix the android wear issues. It's ridiculous. The app worked fine before, and after a recent update the kevo app constantly crashes on my moto 360 2. Multiple crashes every hour."}
{"Author": "Erica Rodriguez", "Date": "May 4, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "tion email</span> I've tried two different email accounts and cannot get a confirmation email to setup my device with the kevo.. But luckily was able to contact the company and they manually confirmed my account.. And now I'm ready to go!"}
{"Author": "ElPearso", "Date": "March 12, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "onfirmation email...</span> Initially I wasn't able to get confirmation email sent.  I Then signed into Kevo on my friends iPhone and got it to resend the email, I was able to confirm my account after that.  Kevo on my android now works."}
{"Author": "Eric Howell", "Date": "March 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "PDATE</span> The app barely worked to start.  Since the 3/8 update it has made my phone unstable and crashes constantly.  Going to wait a few days for a fix them in switching to Yale."}
{"Author": "Princess Ashley", "Date": "March 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "t confirmation email</span> No matter how many times I've tried and checked and doubled checked the email address was right I can't get the app to send the email confirmation to even use it! Very frustrating when I'm using this for my job and can't"}
{"Author": "Jack Tao", "Date": "March 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Never got verification email</span> Tried 2 different email accounts, never got verification email"}
{"Author": "Danny Mudd", "Date": "March 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "This used to work on my Nexus 6P and my Moto 360 1st Gen, but now I get persistent errors on my M360 saying Kevo has stopped working.  Kevo needs to fix this, or at least roll back until they figure out how to fix.  I will be changing my rating when this gets fixed."}
{"Author": "John Zrinzo", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "te</span> There are no big fixes. The app causes Android wear to crash. When I emailed informing them of this problem I received a response back saying they don't do support for the app thru the email listed from the app store. What's the point of having the email on the app store then? Good idea, poor execution."}
{"Author": "Daniel Hicks", "Date": "September 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "How is it that a lock built for people into technology isn't compatible with the latest Android phones like the Note 7. Better yet Android  Marshmallow? See the users of Android have been lied to for too long. We are always the ones that suffer while iOS is developed and updated right away. I preordered my first Kevo with the promise of an \"Android app coming soon\". Actually what happened is they took there time and waited 1.5 years to even release an android app. I patiently sat around and even ended up buying an iPad mini so that I did not have to use the key fob, that did not work half as well as it should have, just to get an app to update my lock and be able to open my door. So the next hurdle has been that suddenly I can't install this on the newest android phones. It has been like this going on a month. I tell you what UniKey..... You can keep your Kevo 2 and stick it where the sun doesn't shine. You claim to have heard peoples issues with your device, but it looks like to me the only thing you did was redesign the mechanics of the lock and added a few new features..... How is this lock any good if you don't support or upgrade the app in a timely fashion. I am keeping my 200"}
{"Author": "shannon cutts", "Date": "March 10, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "t email</span> Tried over and over but confirmation email never came. Frustrating this is the lock they use at work."}
{"Author": "Andrew Gehrke", "Date": "March 11, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "For now,  1 star.  You guys have yet to send me a confirmation email. It's been hours and I've used 2 different accounts"}
{"Author": "Raymond Wages", "Date": "March 15, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": " service call is simple fix</span> Can't use if confirmation email won't come through so I called customer service and it was activated in 2 minutes.   Thanks"}
{"Author": "Tawni Leah", "Date": "March 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ing!!</span> Can't get email! What's the point of having this on my phone if I can't use it. Tried several times!!"}
{"Author": "Vik Mehta", "Date": "April 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "please Fix andriod wear problems on Marshmellow and moto 360 get 20 notifications a day that Kevo has stopped working Update -- now says not compatible with my device (samsung S7) FU KEVO"}
{"Author": "Chi Nguyen", "Date": "March 10, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ea, work so so</span> Hopefully they can fix all the bugs soon.  Sometimes it takes up to 5 sec to open."}
{"Author": "anthony ortega", "Date": "March 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " was right !</span> I can't get them to send me an email for verification purposes... its been 12 hours and 6 re-try's. Not a good start as I am an a/v integrator and could sell these like hotcakes !"}
{"Author": "Nick Nance", "Date": "March 8, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " Kevo idea.  App to lock sucks</span> App very sportic when opening the lock.  Tried recalibrating but only works 50% of the time."}
{"Author": "Elwin Marlatt", "Date": "March 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "r app not working</span> Kevo wear app crashing multiple times a day"}
{"Author": "Moises Moya", "Date": "March 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "</span> This thing doesn't send an email to complete the process."}
{"Author": "Jennifer McIntyre", "Date": "March 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "pan> Same as everyone else. no confirmation email so app doesn't work. wish I'd known this before buying the product"}
{"Author": "Mr Lite", "Date": "March 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "nd verification email</span> I keep resending verification email and it never goes through."}
{"Author": "Edward Perez", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "y it</span> Piece of crap"}
{"Author": "Mario Vega", "Date": "March 8, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "work!!</span> Disappointing"}
{"Author": "Dakilang Pinoy", "Date": "March 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " updating</span> Tried to update and its not responding, kevo need to update on latest version of android"}
{"Author": "Dallas Lott", "Date": "March 11, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "Pretty Well</span> Works good most of the time.  I love the remote locking features..."}
{"Author": "Robert S", "Date": "March 9, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Slow and unreliable"}
{"Author": "Scrappy Coco", "Date": "April 3, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Works like a champ."}
{"Author": "Jordon Dale", "Date": "January 7, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "erface, some lock issues.</span> App has a great user-friendly interface and offers a lot features with my new Kevo lock. However, after installing the app I quickly noticed a firmware upgrade for my newly installed lock. The update itself went smoothly, taking roughly 15 minutes. Myself and others then started to experience issues with the lock detecting our app during our comings and goings. This applied to both Android users (Lollipop and Marshmallow), and an iPhone user. Had to pull the batteries, and reseat them to resolve."}
{"Author": "Mike Tadewald", "Date": "March 3, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "eat</span> Using a Galaxy S6: works nearly every time.  I occasionally (1/10) have to dig my phone out and tap the lock again.  Kevo plus is giving me some issues with setup: instructions are non-existant."}
{"Author": "Jonathan Gray", "Date": "February 4, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "attery</span> Never had an app drain so much battery.  I had to turn the app off from running in the back ground.  I should just use my house key if I want my phone to last by the time I get home my phone will be too dead to open the door. Doesn't work on HTC m8 can't share my key with my mother."}
{"Author": "tony shaw", "Date": "January 18, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " stopped working</span> My Kevo lock's performance was always hit and miss at best, but has ceased working altogether with my Galaxy S5 since the last upgrade. Previously I could get it to work by tapping the phone on the lock, but now it won't even pair. It's back to a regular key.. VERY disappointed!"}
{"Author": "Nick Mayer", "Date": "February 24, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "iss</span> Ever since firmware update that allowed me to lock from the app, the range has stunk. Lock almost never works if I leave phone in pocket. I have to pull it out and hold it right  next to lock. At least 3 tries every time. And this was before the 6.0 update. I'm using an 'approved' device, m9. Exact same issues with Note 5"}
{"Author": "Tin Omen", "Date": "January 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Pretty much does not work when you need it.  I try it every time, and I have to use a physical key about 95% of the time.  The app seems to stop working A LOT.  Pretty much have to log in every time I use it, despite setting the password to remember, and leaving the app running all of the time. (Running all of the time, but it stops all of the time...  so whatever..)"}
{"Author": "Michael green", "Date": "January 6, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": " hate kinda thing</span> Love how lock works just hate how sometimes it doesn't connect to lock. Nothing worse than fumbling for key when raining or cold. Good features as to sending key pass and knowing when and who entered. Would like to see Honeywell lyric support being a Honeywell wifi thermostat. Also wishing that the kevo-plus remote would be available been waiting a long while maybe that would help with connection issues some."}
{"Author": "Christopher Lau", "Date": "February 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "love it now can't stand it</span> Ever since the update a couple months ago, it hasn't worked as well. Range is horrible, won't work unless the app is open, takes too long to respond.  If anyone knows where I can find the old version of the app, let me know."}
{"Author": "Austin Stewart", "Date": "March 10, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "dware is Great....</span> But the App is terrible. Takes forever to connect, and Android wear crashes every hour. Kwikset should dump this developer and find another because this app ruins the lock itself."}
{"Author": "cleavon roberts", "Date": "March 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "t idea ever</span> I can't even update this thing at this point on my Note 5. Buying this lock and getting the app is proving to be a big waste of money."}
{"Author": "Anthony Moffe", "Date": "February 24, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "ke garbage</span> The iOS app works far better than this. Additionally, it has the calibrate functionality which seems to be missing here. This app is slow and inconsistent. Many times the app times out while getting lock status. It takes too long to load. Use the iOS app, it's better."}
{"Author": "Michael Sears", "Date": "July 6, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "eat Nexus 6, but 1 Greatly Annoying Feature</span> Works great with Nexus 6, and from as far away as I can reach as long as nothing is in front of my phone in my pocket.  Major Problem is that it keeps a notification, at the top of your notification list too, about the status of the app.  Is it sleeping, is it working, is Bluetooth off.  There is no way to remove the notification, it is always there acting smug.  If I wanted some usless information cluttering my screen I wouldn't have bought an android device.  Please update with a hide notifications option"}
{"Author": "Andrew Bruske", "Date": "March 21, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Can anyone confirm if the Galaxy S7 works with this lock? Kevo support have been useless in telling me if the new Galaxy will work or not"}
{"Author": "Marco Yeung", "Date": "January 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "crewed it up</span> The app doesn't seem to run in the background anymore. The lock doesn't work unless I open the kevo app. My girlfriend's iPhone is perfectly fine with it though. Please fix."}
{"Author": "Jon Armani", "Date": "January 23, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Unfortunately not working with the Kevo Plus, which was a primary motivator for trusting Kwikset with my home's smart lock duties.  Trying to work with support but their hours are horrible and things are moving slowly."}
{"Author": "Crystal Rockhold", "Date": "February 25, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "It is supposed to work with a Samsung Gear S2 as well as other Android Wear. However, I cannot get it to work. It states \"Update Required These locks can be used with your Android Wear device after you perform a software update.\" I cannot find any way to update and there are no instructions online to help. If there was support out there I would greatly appreciate it, but products shouldn't be advertised as working with no assistance. Up until now I truly enjoyed the product. Will change rating once it starts working as advertised."}
{"Author": "Shelley Muir", "Date": "January 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "gn</span> The lock was hit and miss on working. Tons more improvements to make."}
{"Author": "Theodore Diaz", "Date": "February 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "!</span> Not a good thing when you go to unlock door, and wife inside house says that her phone buzzed and unlocked the door. Calibration is now supposedly automatic. Very disappointing!"}
{"Author": "Heather Smith", "Date": "February 4, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "/span> It won't open the app it freezes every time. Tried clearing all data and force stopping it, didn't work, tried uninstall and reinstall and still doesn't work. Glitchy app."}
{"Author": "Erika Whit", "Date": "January 24, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "ine!</span> I have the Ring Doorbell as well as the Kevo. I love not having to dig for my keys. I keep the fob in my purse, so when I walk up to the door with my hands full, I just touch the lock and it unlocks. It's sooo convenient! With the Ring I get notified on my Note 4 whenever there is motion on my front door step. I can see &amp; talk to whoever is at my door. Now the only reason I didn't give kevo 5 stars is that I haven't figured out how to unlock the door remotely to let them in, without having to send a key."}
{"Author": "Paul Jardin", "Date": "January 6, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " work</span> Does not work with android note 4 and support is terrible. No callback since Christmas and still waiting"}
{"Author": "Donald P", "Date": "March 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "educed functionality</span> Before the latest update, I would be able to unlock the door before exiting my vehicle. Now I have to be right up on the door and physically touch the lock. Sometimes, multiple times before it connects!"}
{"Author": "Marc D", "Date": "January 7, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "rfectly!</span> App works perfectly with my new Galaxy 6 Edge! Can finally lock/unlock my door without taking my phone out of my pocket. Live the Android Wear support too. Keep it up guys."}
{"Author": "Daniel Alcala", "Date": "March 18, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "key</span> Works great...has a bit of a lag but the benefits out way the little bug"}
{"Author": "Chris vollrath", "Date": "March 9, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": " half</span> Lock works fine but the app doesn't work at all I can't unlock the deadbolt from my phone or anywhere while I'm in my shop near the lock from my phone. I want to be able to be in my shop anywhere and lock and unlock it from anywhere in my shop"}
{"Author": "Alan Iq", "Date": "March 5, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "ing on android wear</span> Kevo force closing on android wear smart watch after their new update..please fix"}
{"Author": "Kelly Carpenter", "Date": "March 19, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "eKeys were sent, but never received. Very frustrating."}
{"Author": "Ryan Moore", "Date": "February 26, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ashing a lot</span> Especially on my watch."}
{"Author": "David Li", "Date": "February 12, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Updated on jan 5th now it doesnt work!!!"}
{"Author": "Steve Franklin", "Date": "January 20, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "s no work</span> Kevo plus not working"}
{"Author": "Riant Zandeth", "Date": "January 19, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": " intended</span> Have had no issues with the app. Would love to save guest email addresses for easier ekey access."}
{"Author": "Sam Prado", "Date": "March 25, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "pan> Don't waste your money on this crap..."}
{"Author": "Steven Mainini", "Date": "January 6, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "Works On Droid Turbo!!</span> App works great! Been waiting forever to finally use these features."}
{"Author": "Becci A", "Date": "February 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Worked fine before now it hasnt opened the door in weeks!!!!"}
{"Author": "Todd Baksa", "Date": "March 8, 2016", "Stars": " Rated 5 stars out of five stars ", "Text": "eat</span> Love it! Works great!"}
{"Author": "Jason Phillips", "Date": "December 28, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "rdware, app needs work</span> All the instructions, including the online video, showed a calibration process that doesn't seem to exist any more. I dug into the faq's and found a reference to a beta app automatically calibrating so a manual method wasn't needed. I tested the door and the in/out functionality worked. I can only assume the new version no longer needs to calibrate. App is running in the background for me, I did not need to open it for the lock to work. Overall I am satisfied with the performance but the app could be better"}
{"Author": "Robert Joy", "Date": "December 28, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "ing well with Note 5</span> I have a Samsung Note 5. I literally have to put the phone right next to the lock to get it to work. It appears this is associated with the latest update. Can you please investigate and fix ASAP? Thanks!"}
{"Author": "Ree Winston", "Date": "November 19, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "ended my love for Kevo</span> I recently updated my app now it doesn't run in the background as it did all day without issue. It closes out completely and I look like an idiot with a fancy lock but it takes me several minutes to enter. Before this last update I had no issues what so ever and would have given it 5 stars... FIX IT PLEASE"}
{"Author": "Robert Mungary", "Date": "December 22, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "nting and embarrassed</span> It locks and unlocks. Big whoop,  all locks do that.Kevo advertises it to look awesome. They don't clearly tell you that you have to have the \"plus\"  device to use the best features (remote monitoring, remote lock... ) which is unavailable. Wtf?  There are no \"scheduled\" keys or limited time keys either. They advertise that it work with wearable devices. Not true today. I'm embarrassed that I bragged about this device. Have to take it off and put back the old keypad. Half baked and deceptive until Corrected"}
{"Author": "Damir Mustafic", "Date": "December 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "t 'smart' key</span> Don't buy this pos. It's not working with 4 of 4 Android devices I have. It's a premature product with a gazillon bugs, and for the price tag, it sure as hell is not worth it. Give it a few more years or look for a trully conneceted lock. This however, is not it."}
{"Author": "Roland Harrison", "Date": "December 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "crewed my lock.</span> I used to love my Kevo, and gave it  5 stars.  Things changed in a heart beat.  Update screwed it up like all these              other people.  My kevo app has gone AWOL !!!  Where did it go? Before I bought the Kevo lock, it had a customer rating of 4+ stars overall.  Now I have a problem &amp; I look it up only to find that all sorts of people have the same thing.  This is no way to run a business !!!"}
{"Author": "Paul Minto", "Date": "November 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ter on iPhone, disappointed</span> Have to restart the app for the door to unlock. I don't trust it because it not work as advertised when I bought it. My friends have iphone and they have the same unit and it works perfectly fine. Very disappointed, shouldn't have feel like I have to get an iPhone for my door locked work right."}
{"Author": "Raul Cortes", "Date": "March 23, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "s not easy</span> I have tried many times to make this thing work unsuccessfully. Support not good enough. It only connected once to the network for an update and it doesn't detect Locke even if placed side by side."}
{"Author": "Duane Dempster", "Date": "December 4, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " Frustration</span> Would have to be one of the most annoyingly unreliable and frustrating products I've ever bought. Inconsistent experience when you need a reliable means to access or lock your home. This device is not able to be trusted. And support is woeful. If I could give zero stars I would. When it works, it works as 'it should'. Use the fobs, slow and unreliable. Use the manual search lock/unlock 'feature' - painfully slow and unreliable. Really only works with Apple and Samsung - everything else is a compromise."}
{"Author": "Marc Dyker", "Date": "December 30, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "uined it</span> Doesn't run in background any more,  have to open app every time i want to lock or unlock the door"}
{"Author": "Ron Rudman", "Date": "December 13, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "pdate sucks worse than the Toronto Maple Leafs</span> App always crashes, takes several attempts to get logged onto my account and it will not connect with my deadbolt so now I can't even check if my door is locked without physically walking downstairs to do it....I used to love my Kevo before this latest update :("}
{"Author": "Marten Skupien", "Date": "December 6, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ate just sucks</span> This last update made the kevo incredibly unreliable. Several times I've been locked out of my own house. I now have to keep a physical key with me just in case. So I ask myself what's the point of the darn thing. There better be an update that fixes this soon, or the lock is going in the garbage where it belongs."}
{"Author": "PJ Wallace", "Date": "November 18, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "resync to my gateway every update!</span> I travel frequently and the remote open and lock features of the kevo are great. When it works. Every time there is an update to the app I have to go home and resync my phone with my Gateway before I can open my locks remotely. Very discouraging. And not very convenient for an app and lock that are supposed to be convenient."}
{"Author": "Isaac Rodriguez", "Date": "November 24, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "en it works but unreliable</span> Consistently longs me out then tells me my password is wrong. Then I go change it. Still doesn't work. Would recommend a regular key."}
{"Author": "Dan Geil", "Date": "December 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "upport the Plus!</span> Finally got my Kevo Plus and was so excited. It has some major issues. The app asks you about bluetooth every time you go to the main menu - I have Plus, I don't need bluetooth. It also crashes quite frequently. Finally, it keeps saying my lock is jammed when it is physically not, and doesn't always seem to update the status when locked or unlocked manually from the inside. Basically, the Plus doesn't appear to actually be supported in the app. Please fix!!"}
{"Author": "Kelli Lowery", "Date": "December 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "o...</span> Randomly opens anytime I get on my phone and closes other apps to open itself. Constantly makes you log into it which never happened pre-update, it was able to run in the background no problem. Then, when I actually log on it can't seem to connect to the lock. I'd delete it if it wouldn't result in me getting locked out of my house."}
{"Author": "Chetan Patel", "Date": "December 17, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "ror</span> Getting an error when I try to pair \"Kevo -Too many Bluetooth smart applications are running, close some applications for kevo to work\" -OnePlusX .. Can't figure out how to solve this"}
{"Author": "Kris Hibbert", "Date": "December 17, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "y...</span> I love the idea in theory, but $2 for a key after we've spent a lot just getting the lock itself is pure BS. In a family of 5, with 3 people that need keys and 2 that will soon, that not cool."}
{"Author": "Todd Olynyk", "Date": "December 1, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " heck happened</span> Since the last upgrade my Weiser Kevo does not work at all. Why do I never see anyone answering customer concerns on this place.  What have you guys done?"}
{"Author": "Patrick Graham", "Date": "December 14, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "tent and buggy</span> When you get lucky this seems decent enough, but sooner or later youll start to have trouble getting the door to unlock. Youll try to recalibrate it and have the app tell you it cant without giving you a reason. It will tell you to reset the lock. Youll reset the lock and then never be able to recalibrate your phone again, then have to reprogram the fobs. You'll have trouble re calibrating the fobs. After hours of messing with it youll give up, uninstall the whole lock, and wish you had never bothered."}
{"Author": "Vincent Poy", "Date": "December 6, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " after 1.0.27p will login</span> On the LG G4 Verizon Wireless VS986 running Android Lollipop v5.1, app versions after 1.0.27p will not login successfully as it says login unsuccessful and using the same login credentials on mykevo works fine."}
{"Author": "Larry Schug", "Date": "December 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "real key</span> Was working until their rush to create a paid app after I bought and paid for lock. After last update need to open app to open door. I have turned off auto update so it won't make it difficult to open with my real key without paying more $$"}
{"Author": "Paul DeFeo", "Date": "December 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "work on Marshmallow</span> App worked ok on Lollipop. Now after update the Kevo app continues to search for lock even and never finds device.  Keeps saying lock is not in range or Bluetooth is not enabled. Both are incorrect.  Pretty bad."}
{"Author": "Brent Buxton", "Date": "December 8, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ps up on top of other programs</span> On a drive using goggle map/GPS software, Kevo kept popping up on top of map &amp; phone would turn off. Didn't do till last update."}
{"Author": "Bradley Thompson", "Date": "December 11, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "I used to love this idea...It worked well until the last updates where I often had to open the Keo program to get the lock to open,  but Samsung fixed it my problem after the edgeplus update and  I can no longer login to the kevo program anymore..wrong password and I know it is the correct password.  I hope I can find my old fob..."}
{"Author": "Jason Lowery", "Date": "December 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "Hate it now. Randomly opens the Kevo app and asks for my password at least 20 times a day. Latest update ruined my $300 lock. Time for a Schlage!"}
{"Author": "TIM Neer", "Date": "December 5, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "Lock and app suck.  They will not work on phone at all.  $200 for a piece of junk.  Should be embarrassed for ripping folks off with crap product"}
{"Author": "Jennifer Castañeda", "Date": "February 29, 2016", "Stars": " Rated 3 stars out of five stars ", "Text": "/span> Works when it wants to. The remote lock is useless unless you're just a few feet away from the lock itself."}
{"Author": "Michael Lavigne", "Date": "December 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "Kevo locks are unreliable, nobody answers the phone for tech support"}
{"Author": "Scott Tinker", "Date": "December 18, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " connect to deadbolt</span> App stopped connecting to my deadbolt making it useless."}
{"Author": "Matthew Austin", "Date": "December 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "After Update.. Locked Out</span> I have a Galaxy S5 in Canada and after the update the Bluetooth won't initialize and now I can't get into my house (spouse has key fob). Now I have to carry around a key. Please troubleshoot the app, this is bad."}
{"Author": "Robert Owens", "Date": "December 4, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "etty good</span> A little touchy."}
{"Author": "Grant Ammons", "Date": "November 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ly logs me out</span> It constantly logs me out and then the app always comes to the foreground asking me to log in."}
{"Author": "Chad Anthony", "Date": "November 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "rge $1.99 for a 3rd key!</span> WTF at least mention this somewhere before I spend 200 on a lock..."}
{"Author": "Trent Bridgman", "Date": "December 17, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "Like is lock as long as it keeps working . You don't have to worry about getting into your pocket to get keys."}
{"Author": "Jakob Johnson", "Date": "December 22, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "wait for the future of automation</span> For a new, to many, concept (lock automation) - it'll do."}
{"Author": "Magnus Lazatin", "Date": "November 10, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "reat... Once</span> I installed the app, got a key, used it, locked my door, and went to sleep. The next morning, and every time afterward, the door would not unlock. The app claims that my Bluetooth is off when I have it on and working (I was streaming music to my Bluetooth headset not two minutes prior). The lock itself is definitely working because my brother and his girlfriend can both unlock the door with their iPhone apps. Seems like this app is really flaky and it needs to be fixed. Until then, physical keys for me"}
{"Author": "Chris Stringer", "Date": "November 8, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "duct ridiculous prices</span> This product (lock and software) is terrible. Everytime I touch the lock I need to pull out my phone and wake it up. Might as well use a key.  The fob doesn't work at all. And Kevo expects people to pay $70 for the upgrade version of the app?  I would have taken the lock back if it wasn't such a pain in the butt to install. This is the worst home automation product I've ever used. Ridiculous prices, intermittent performance, huge battery drain."}
{"Author": "matthew maxwell", "Date": "November 9, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "nted</span> Probably my fault for not researching well enough before I bought the lock, but I did not realize how small the list of supported devices is. Of course the LG G3 is not supported. Nonetheless after every update, I check to see if the app works. After the last update I got excited because it seemed like the app was working. , now my phone just informs me that \"too many devices are connected to smart Bluetooth\", even though nothing is connected to my phone, and won't connect to the lock."}
{"Author": "Josh Putnam", "Date": "November 5, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "nted</span> My LG G3 is not supported. I was also told that there would be Wink Hub support. No phone and no home automation support makes me a sad guy. :(  I followed the instructions given in the reply, yet the new software still fails to work.  I now know that this is an LG issue and I have decided to change my rating. Also, the Dev team for this app is very responsive, so kudos! Is it true that the Wink Hub will have Kevo support soon? Thanks"}
{"Author": "Carlos Lopez", "Date": "November 16, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " set up with any Android devicss</span> I had to borrow a friend's iPhone to get it to update the firmware before I could get it working. I tried 3 different Android devices. Only would one unlock but it wouldn't update."}
{"Author": "Adam Ford", "Date": "November 5, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "Easy to use and it does the job"}
{"Author": "T Reyes", "Date": "October 24, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "span> We don't need the constant instruction to \"tap your kevo to unlock\" in our notifications.  We get it.  When Bluetooth is on, we can tap to unlock.   Maybe just have an initial notification upon connecting that is able to be cleared.  Not an unclearable instruction that never goes away. Update:  Although the constant notification remains and is annoying, you get a 4th star for adding the remote lock/unlock feature."}
{"Author": "Radu Babos", "Date": "October 27, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "ly working</span> After installing the lock and setting it up that's the only time it worked. Updating the lock was a horrible process not as easy as it should of been. The update works fine locking and unlocking from the app, but touching the lock still doesn't work."}
{"Author": "Richard Leger", "Date": "October 25, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "nd ekey</span> After downloading the new update I now can't send an ekey. Rebooted and tried to no avail. Bluetooth lock and unlock works great though..."}
{"Author": "Ricky Williams", "Date": "October 26, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "s door lock and app</span> I got the kevo lock and app a couple weeks ago and I love it ordered another lock for my shop. Wish it worked with my gear S2 hoping it's in the next update."}
{"Author": "", "Date": "October 27, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "I am returning this product tomorrow because it has the ability to be remotely controlled via wifi but this company charges $70 for that even though you already pay $200 for the doorknob."}
{"Author": "rajnish sharma", "Date": "November 4, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "Last two days I'm trying to update. But it's not working"}
{"Author": "Theresa Jakoubek", "Date": "October 27, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "Momma T"}
{"Author": "Faraz Khan", "Date": "October 21, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "st version breaks lock/unlock</span> I can't lock/unlock anymore after updating to 1.2.30. 1.0.27 seemed to work but the new one seems completely borked. Pairing worms though."}
{"Author": "Steve Jones", "Date": "October 20, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "pdate has fixed crashes</span> Everything seems to be working well! Thanks for the speedy update."}
{"Author": "Dan Burke", "Date": "October 20, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "ion with Marshmallow</span> Phone is now working perfectly with the Kevo app"}
{"Author": "John Ewing", "Date": "October 19, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "erytime</span> I love this lock"}
{"Author": "chris kasa", "Date": "October 14, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "ng I wanted and more.</span> I bought this lock because I hate fumbling with my keys in the dark, or having to go back to my truck when I leave it running and my wife has the door locked.  It works perfectly on my Samsung galaxy s5.  Also my youngest had trouble using a physical key and my oldest is irresponsible, so I attached two fobs to their backpacks for after school use, fantastic.  We haven't used a real key in over a month and my kids actually lock the door when they leave the house now!  Thanks Kevo!"}
{"Author": "Shane McAree", "Date": "October 13, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "but issues</span> Have s5 and a note 4 and I can not get either to work.  Getting a key on them worked but neither will open the door. I was able to use my phone to update the lock to the latest version. Android 5.x"}
{"Author": "Craig Guttridge", "Date": "October 13, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "a poorly executed. Just use a key.</span> The lock itself is cheap and nasty. I wrote along letter of complaint pointing out some of the basic flaws but never got a reply. Like everyone here had issues getting it to open across a few devices. Better with just one administrator sending ekeys as it doesn't cope too well with multiple registrations. But the biggest thorn in my side is they have just updated the software so that it has functions similar to the more expensive locks like Lockwood. But to access the new features you have to pay $69.99!!!!"}
{"Author": "Evan Berry", "Date": "October 14, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": " work with all android phones</span> Worked OK with my samsung galaxy s 5. I got a new Alcatel Idol 3 and it won't even let me download the Kevo app. Says my phone is not compatible.  That's really a shame."}
{"Author": "Jason Sanders", "Date": "October 15, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "seems to miss activities</span> Key fob and some of my locks and unlocks do not seem to be in the history. Please fix. Other than that great. I cant wait for kevo plus."}
{"Author": "Terriell Flanagan", "Date": "October 16, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": " APP</span> Great app never forget your key again. I think it looks great only complaint is the sleep mode. Often ignores the request"}
{"Author": "Garrett Brainard", "Date": "October 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "None of the three buttons (add portal, key, or send key) do not work. I tried consoling the troubleshooting but this was not an option."}
{"Author": "Gilbert Franco", "Date": "October 16, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "/span> Haven't had any issues so far great system!!!"}
{"Author": "lobuxracer", "Date": "October 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " work after latest update</span> Complete and utter failure after the latest update.  If I did not have physicals keys I would not be able to get in my house.  Total waste of time and money."}
{"Author": "Matt McCauley", "Date": "October 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " developers</span> Android 6.0 issues like everyone else. The preview has been out for 4-5 months, there are no excuses for these issues. Returning my lock if this isn't fixed quickly"}
{"Author": "James Stewart", "Date": "October 3, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "pan> Not currently working with LG G3. Locks don't detect phone."}
{"Author": "Fazal Rahman", "Date": "October 7, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "described</span> Working just fine on my Samsung Galaxy Note 4, Android version 5.0.1"}
{"Author": "Jim Benson", "Date": "October 1, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "eat</span> Lock reacts so much faster to the app then the key fob"}
{"Author": "Keith Hustedde", "Date": "September 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ong for Android support</span> I was told when I bought this I would get 5 free ekeys.  To my disappointment they were behind the times with their technology and only supported apple phones.  I was told not to take the lock back because they would have Android support by the summer of 2014. Well we know that did not happen.  Then they said my free ekeyes were linked to my account and not to worry about losing them.  Well that was also  lie because now they want to charge me for the right to unlock my own door."}
{"Author": "joshua bergfield", "Date": "July 31, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "ge for ekeys?</span> Great product that works with my s6 edge, but why should I be charged $1.99 for ekeys? After paying $200 for a lock and an extra $25 on an extra fob for the wife while waiting for android support, I now have to pay for the only feature I was missing out on. Not cool."}
{"Author": "Brandon Parker", "Date": "September 17, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "so after my phone just stopped being able to open my door i figured out why. After already having the kevo app installed and working on my galaxy note 5, all of a sudden it isnt compatible with my phone. found that out after i uninstalled it and went to reinstall.  update: took away a star because they added support for the note 7, and NOT the note 5"}
{"Author": "John Cantelo", "Date": "August 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "Happy</span> Just spent well over $250 , and $10 worth of ekeys for the family. and having nothing but trouble. Fob didn't work out of the box. Had to program.  after all is said, done and set up yesterday, I now can't lock my door with my phone today(yes bluetooth is on). good grief!"}
{"Author": "Ethan Miguel Serkey", "Date": "July 15, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "l address IS valid.</span> It keeps telling me to enter a valid email address when I try to login. Valid in what way? It’s a working address. It’s the one I use to register on the website. Is it too long? (29 characters) I’ve occasionally had that problem with other apps. What kind of shortsighted ignoramus developer sets a character limit that low on a field that can have such varied answers? Well, maybe the problem is something else this time. But whatever it is, please fix it a.s.a.p.."}
{"Author": "Soldier Lock", "Date": "August 29, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "ixed all of my complaints</span> First Android version wasn't working well for me and I had some complaints. With the recent updates all of my issues have been fixed. Works every time, I love my Kevo again."}
{"Author": "Roy Roderick Ramos", "Date": "September 7, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "Smart Device</span> Installed working on my two Samsung Note 4 and after a quick fix by tech support, we were able to also do the same on our two new Note 5. Our Kevo is also integrated with Nest but not really utilize yet it's full potential."}
{"Author": "Gary Patrowicz", "Date": "August 22, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ing a email to my Gmail</span> Bought a key and it is no where to be found never sent the email and now I have no key and am out 2 dollars and spent 45 minutes on hold for them to hang up on me before I could say three words"}
{"Author": "Tony Cordova", "Date": "August 26, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "ck</span> Great gadget....I wish you could register the key fobs or see in the history every time the door was locked/unlocked. Seems like the only history that you can see is when a ekey is used."}
{"Author": "Dero Kratzberg", "Date": "July 11, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "ut needs work</span> Some phone seem to have a wake lock issue where this app thinks the phone is asleep when it isnt"}
{"Author": "Donald Won Cho", "Date": "August 18, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "now working.</span> I wish this app / lock had a manual locking method while out. If I was at work I could press a button through the app to unlock the door."}
{"Author": "Shivam Takulia", "Date": "July 24, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ing</span> I use s6 edge and when i log in to my account it doesnt show my ekey ...i have tried changing the id also but still it doesnt show my ekey"}
{"Author": "Joe G", "Date": "July 24, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "Great when works but auto-wake is unreliable"}
{"Author": "Craig Gordon", "Date": "July 10, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "It's great"}
{"Author": "Rebecca Beil", "Date": "May 25, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "ea, horrible implementation.</span> If my app goes to sleep, there is no waking it. All other motion functions of my phone work but not this app. And why can't I give keys to as many people as I want. I am regretting this purchase."}
{"Author": "SNS 101909", "Date": "June 6, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "ood</span> Installed in minutes and had my S5 working the lock shortly after.  Sent the wife the link to download app just to find out doesnt work with Note 3.  Guess she has to use the fob.  Happy overall,  works every time ."}
{"Author": "Greg Fagnan", "Date": "June 8, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "but not android friendly.</span> Setting up on my note4 was a breeze.   Sending a key to my wife (who has a nexus) defaults to the iTunes store,  not the play store... With a vicious circle tied to the invite.   No way to select the play store... Come on!"}
{"Author": "Shivian Morgan", "Date": "June 17, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "s</span> App makes you PAY for people to have keys (ARE YOU KIDDING ME?!) and then DOESN'T WORK on several phones (like the Nexus 5, a very standard phone). Removing lock from door, sending back. 100% not worth it."}
{"Author": "William Chambers", "Date": "June 1, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "p ever!</span> Have downloaded over 500 apps through years, had mobile phones since Motorola Star Tech. Unable to even register. Keeps stating email I've had for years is invalid. Use Kwikset as builder, after waiting for app on my Note Edge very disappointed with Kwikset!!"}
{"Author": "Rob Klassen", "Date": "June 28, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "</span> The app instructions provided with the lock are completely outdated which made for some confusion, cannot calibrate the lock. It wastes almost 50% more battery compared to before i installed app, now i have to charge my phone to make it through the day."}
{"Author": "Kuni Agard", "Date": "May 22, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "s only taken 24 months to get this to work on android.</span> Finally. . . unless you had iPhone you were SOL. Bluetooth low energy, and finally on the Note 4. Better late than never."}
{"Author": "Johnny Moss", "Date": "June 22, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "Stiil not able to wake on Galaxy S6. and yes I have the latest update. Worked fine on previous version"}
{"Author": "", "Date": "May 15, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "/span> The lock works great the app is awesome.  Thank you for releasing an android version."}
{"Author": "Michael Richardson", "Date": "May 31, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "Only lollipop (Note4?), not my other BTLE devices?"}
{"Author": "Yawansumame", "Date": "July 8, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "got my ekey....but</span> I still have not received my email from kevo to verify my account."}
{"Author": "Peter McNaull", "Date": "May 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": " nexus 6 - not see app for S4</span> Sent a key to individual with a S4. A search in the play store on her phone doesn't show the kevo app. I shared the kevo app from my phone, nexus 6, still no luck. What version of Android is required to run the kevo app?..... Just read on the support site that S4 is not supported. Is that a hardware issue or os issue? Either way will have to downgrade my rating because of limited support for android and will have to return the product.... Just tried to send a key. It failed... Grrrrrrrrrr"}
{"Author": "Work", "Date": "May 9, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "the lock then pay for for someone else to have a key!?</span> So you pay $300+ for this fancy lock that works 50% of the time and clutters up your phone notifications permanently and then you dare ask for more money to send a key to a family member? Garbage."}
{"Author": "Rolan Somerville", "Date": "February 28, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "otoX 2014?</span> Great to finally see Kevo on Android.  Is there any reason why the Moto X 2014, which runs Lollipop and is very similar to the Nexus 6 from a hardware perspective, isn't supported?"}
{"Author": "James Adkins", "Date": "April 24, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "progress</span> Pretty good app but it can be inconsistent at times. Also I would like to see the ability to unlock the door in the app without touching the lock."}
{"Author": "Mark Zeiger", "Date": "March 31, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "creation does not work</span> Tried to create an account but message returned indicated account creation was unsuccessful without any explanation as to the problem."}
{"Author": "Dave", "Date": "April 16, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "M9</span> I have a new HTC one M9, and even though Kevo says the HTC one M9 is compatible the Play store says my device is not compatible with this app"}
{"Author": "Chris O'Brien", "Date": "April 25, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "n?</span> The most disturbing aspect of this app is that it requires a \"a login to kevo's servers\""}
{"Author": "Tom Crews", "Date": "March 25, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "/span> Works great with my Nexus 6.  Has worked every time with no issues.  Jeans, dress pants, no issues."}
{"Author": "Sean Kelly", "Date": "May 9, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "M8 support</span> Time to open support to more phones...."}
{"Author": "Jon Wolff", "Date": "February 7, 2015", "Stars": " Rated 4 stars out of five stars ", "Text": "ood</span> Only complaint is occasionally it tells me my phone hasn't moved recently and won't open my lock.  If I jump or wiggle it then works.  It might be good to add a motion sensitivity adjustment to the app."}
{"Author": "chris lietz", "Date": "January 30, 2015", "Stars": " Rated 3 stars out of five stars ", "Text": "o update lock.</span> Just installed and went through setup. App indicated I need to update the lock and tried a handful of times. Either nothing happened or I got a message to retry. Will restart app later and try again (this is on a Nexus 6). Otherwise, looks good."}
{"Author": "Matt Meierstein", "Date": "January 23, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "pan> Works better than than my wife's iOS app"}
{"Author": "Thomas Schneider", "Date": "December 21, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": "ting for this App for Android</span> App works great so far. Setup was quick and easy. The first thing it did was upgrade the lock. It has worked every time so far with the phone in my pocket. I haven't noticed any extra battery drain. Finally able to take the fob off of my key chain."}
{"Author": "Joseph John", "Date": "January 5, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": " described. Responsive dev team</span> No major complaints - some initial bugs were there in this Beta release, that the responsive dev team addressed. Hopefully, the dev team will continue to be responsive after this becomes more widely adopted :)"}
{"Author": "Reaford Blackburn", "Date": "January 15, 2015", "Stars": " Rated 5 stars out of five stars ", "Text": "lly</span> Finally. Been waiting forever. This works so much better than the fob. It's working beautifully so far and was very easy to set up. Now I'll get a kevo for the other doors in my house."}
{"Author": "Sal42na 68", "Date": "December 31, 2014", "Stars": " Rated 5 stars out of five stars ", "Text": "l the Nexus 5 version be ready?</span> When will the Nexus 5 version be ready?"}
{"Author": "Garin Hiebert", "Date": "March 14, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "ersion doesn't work</span> I used to like using my Kevo locks, but with the latest update my Moto 360 watch repeatedly notifies me (about 20 times a day) that Kevo is no longer working.  After a reinstall, the Kevo app on my phone does work, but it is slow to unlock.  It's a lot faster for me to just find my key and manually unlock the door.  I've uninstalled the app and will be manually unlocking for now..."}
{"Author": "Chase F", "Date": "September 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Please fix this dreadfully glitchy app.  I understand you're probably more of a hardware company but this is not a reliable app whatsoever. I fear that if this type of issue exists that the software arm of your business (or your service partner) is completely incompetent and endangering the safety of me and my family.  I've sat by my door for 25 minutes now trying to connect and all the app wants to do is search for a lock, despite everything else working fine.  I will be following up with your support team.  Not a happy customer as of now."}
{"Author": "Diego Mejia", "Date": "June 29, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": " is garbage</span> Kevo keeps crashing on my Android wear Device roughly 20x a day. And the standalone app won't even see my phone even at 1 foot away. I didn't pay $200 only to use a fob."}
{"Author": "Alvin Wong", "Date": "February 13, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "</span> Won't ever unlock and when it does it stops working in a few days."}
{"Author": "Jim Adkins", "Date": "May 21, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "span> Range is horrible on lock never sees my phone in pocket. Don't waste your money on kevo plus it can't be placed between two locks and is the slowest process to use. Android wear app is a pos constantly crashing and white screens my watches overnight so I wake up to dead batteries off of the charger fix your garbage software"}
{"Author": "james robertson", "Date": "September 19, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Pure garbage! app was able to connect during set up, but is incapable of doing anything it's designed to after that. DON'T WASTE YOUR TIME OR MONEY! FIND A BETTER SMART LOCK WITH A BETTER APP!!"}
{"Author": "Chris Grandell", "Date": "May 3, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "oduct, app works awesome, wear support is bad</span> App is great, especially with the Kevo Plus Gateway.  Constantly force closing on my moto 360 gen 2, I get a notification about every 15 minutes.  It's painful."}
{"Author": "Carter Coberley", "Date": "June 24, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Used to work fine with my Moto X first generation. Then an update killed the app. I went so far as to buy a NEW Moto X Pure Edition with Andriod 6.0. The app is not compatible with my device? What gives? I have paid to have 2 of these locks installed in my home on the premise that I could (and used to be able to) use this with my smart phone. Wife's Samsung phone works just fine, but no dice on either Motorola. Kevo - please fix this - there is no excuse as to why this app should be incompatible with my device, especially running the latest version of Android."}
{"Author": "", "Date": "March 31, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Works very well on my note 5. I have to agree with another poster below and that all of these people giving 1 stars due to Blu tooth issues is misleading. That's probably an issue with your phone rather than lock. I do NOT have to have app running in background to work,  I leave the phone in my front pocket,  and can effectively engage the lock within about 3 to 4 feet of the door. Works very well on my wife's iPhone 7 and iPhone se, however,  they DO need the app running in back ground to work (sucks to be apple)"}
{"Author": "Max Gerega", "Date": "October 12, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "pping up with Bluetooth error</span> It's a great lock and works with the fob but for some reason on my LG g3 running lollipop every time I open the app it always tells me too many things are runing on Bluetooth even though nothing is. It's really annoying and I need help fixing this problem otherwise I have to return it."}
{"Author": "Ivan Hendricks", "Date": "October 28, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "ays it's sleeping?</span> These last few updates have put me into  to  a position where I had zero issues prior and loved it. Now I can't count on it at all. Fails about 80% of the times. Dang thing says it's sleeping. What the heck is that? It's not nap time. How do I tell it not to go to sleep? It's says to shake it. I shook the memory from my phone and it's still napping.  I did love it, now I can't count on it. Please, I want the older version! Update: Found out that I needed to turn off power save mode. Bumping up rating."}
{"Author": "Diego Cepeda", "Date": "January 9, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "!</span> Watch out for Kevo not responding to phone and being locked out. The app was indicating lock was open when it wasn't actually unlocking the door! Fortunately I had spare key in car to manually open."}
{"Author": "Liam Chen", "Date": "December 26, 2015", "Stars": " Rated 1 stars out of five stars ", "Text": "t buggy</span> It took at least 10 attempts to lock my house and in that amount of time I managed to miss a bus that was 5 minutes away when the bus stop was only 2 minutes away. Not impressed Kevo."}
{"Author": "Martin D. Robertson", "Date": "September 26, 2017", "Stars": " Rated 2 stars out of five stars ", "Text": "Terrible software. Do not waste your time or money on this product.  I habe had this device for a year and instead of it getting better it has gotten worse."}
{"Author": "", "Date": "May 17, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "They're getting better! The customer support is extremely slow, and not very helpful at times, but the warranty is handled well, I had to have mine replaced twice, didn't cost me a single penny... (once it was even my fault, I ripped some wires off the curcuit board accidentally! ). One cool feature is the re-key, which lets u use ur current or existing door key assuming its the same brand as your kevo (mine is by kwikset). This also works if you have multiple doors, no matter how many, one key does the job for all of them"}
{"Author": "", "Date": "September 16, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Worked great until I got my Note 8. Please fix compatibility issue ASAP!"}
{"Author": "", "Date": "September 15, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Really love my new locks and even more happy with the changes Kevo has made over the last year. The app is leaps and bounds better, I find that my locks pair and open in a couple seconds when I tap them. My only reason not to give 5 stars is because on my Pixel with Android Oreo I have a constant notice that Kevo is running in the background (because it has to in order to function properly). I wonder if there is a way for the app developers or me to disable that notice? Would also be great to have an app for Samsung Gear but that's more of an issue since it runs Taizen and not Android..."}
{"Author": "Jeff Jolley", "Date": "June 4, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "seful</span> I'd rather use a key than re-enter my password on a daily basis. Big fail."}
{"Author": "F K Faridi", "Date": "April 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Love this lock so far i am using iphone 7 plus and Samsung edge 7 plus, love the  concept works similar to my jeep.  No keys to fumble for,  i did have to reset the lock once with my phones , but it's working fine. Advice still carry key with you must in case"}
{"Author": "", "Date": "May 8, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Breaks with every android update - only works when app is open or I actually slide to look at the \"Kevo is ready\" notification. It's working again, but wish they'd be a little more on top of things with the updates."}
{"Author": "James Segars", "Date": "March 15, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "/span> Can't get the confirmation email no matter what I do.  It's been hours since registering.  App is worthless out of the gate.  Hope there's an update asap."}
{"Author": "Michael Faust", "Date": "September 10, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "Requests too many  permissions (browsing history, bookmarks, account profile, location, photo/video access, etc). This is a door lock app, not a social media app!  Also, crashed on first use with Kevo 2.0 lock"}
{"Author": "Wren Scheidl", "Date": "February 22, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "App doesn't work on Samsung Note3.   Phone is a couple years old but why can't the lock and the app work with older phones?"}
{"Author": "Roger Venable", "Date": "April 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work that well and impossible to recalibrate.  All technical details are hidden from you making the app almost worthless."}
{"Author": "", "Date": "April 9, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Bluetooth connection was unstable on my one+3 and the app frequently locked up showing just a white screen"}
{"Author": "Geunhwi Lim", "Date": "February 2, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "Pixel failed in pairing but is working with shared ekey from Nexus5. At least I can open the lock."}
{"Author": "Jake Frazier", "Date": "January 14, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "rk on nexus 6 p</span> I'm very upset my new nexus 6 p don't work with this app apparently anyway"}
{"Author": "Regie A", "Date": "May 13, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Doesn't work with my Sony Xperia Z5, please add the Sony products."}
{"Author": "", "Date": "September 11, 2017", "Stars": " Rated 4 stars out of five stars ", "Text": "love the kevo lock, has connection issues sometimes. Other than that it's  a wonderful smart device for your home!!"}
{"Author": "lrh78963", "Date": "March 7, 2016", "Stars": " Rated 1 stars out of five stars ", "Text": "rk</span> Tried to use it and it won't work on my phone."}
{"Author": "Carlos Giraldo", "Date": "July 2, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "One plus one not supported"}
{"Author": "Songkran chunjai", "Date": "October 8, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "I can't download the app.  I brought your product but the product need the use with the app"}
{"Author": "Bryan Maddex", "Date": "February 3, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Pixel support added, thanks Kevo team!"}
{"Author": "Bonita Johnson", "Date": "November 11, 2016", "Stars": " Rated 4 stars out of five stars ", "Text": "Galaxy 6</span> App worked great !"}
{"Author": "Amin Ahmed", "Date": "November 11, 2015", "Stars": " Rated 2 stars out of five stars ", "Text": "Not working on my LG G3."}
{"Author": "Patrick Lafaille", "Date": "June 10, 2017", "Stars": " Rated 1 stars out of five stars ", "Text": "Will not connect to the lock"}
{"Author": "Peter Otmar", "Date": "January 7, 2016", "Stars": " Rated 2 stars out of five stars ", "Text": "Not working. Keeps turning blutooth on automatically."}
{"Author": "", "Date": "June 9, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "It's so convenient and easy to use."}
{"Author": "Tammy R Schaal", "Date": "May 27, 2017", "Stars": " Rated 5 stars out of five stars ", "Text": "Amazing, simple and secure!"}
{"Author": "Elvie Skiver", "Date": "August 19, 2017", "Stars": " Rated 3 stars out of five stars ", "Text": "Working"}
Kevo: Number of reviews: 968
